Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 630, ICM Interrupt Group Register for Module Error Interrupt Information */
#define GTM_ICM_IRQG_MEI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_MEI*)0xF0100630u)

/** \brief 634, ICM Interrupt Group Register 0 for Channel Error Interrupt Information */
#define GTM_ICM_IRQG_CEI0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI0*)0xF0100634u)

/** \brief 638, ICM Interrupt Group Register 1 for Channel Error Interrupt Information */
#define GTM_ICM_IRQG_CEI1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI1*)0xF0100638u)

/** \brief 63C, ICM Interrupt Group Register 2 for Channel Error Interrupt Information */
#define GTM_ICM_IRQG_CEI2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI2*)0xF010063Cu)

/** \brief 640, ICM Interrupt Group Register 3 for Channel Error Interrupt Information */
#define GTM_ICM_IRQG_CEI3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI3*)0xF0100640u)

/** \brief 644, ICM Interrupt Group Register 4 for Channel Error Interrupt Information */
#define GTM_ICM_IRQG_CEI4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI4*)0xF0100644u)

/** \brief 664, ICM Interrupt Group MCS 0 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100664u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS0.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS0.
*/
#define GTM_ICM_IRQG_MCS0_CEI (GTM_ICM_IRQG_CEI_MCS0)

/** \brief 668, ICM Interrupt Group MCS 1 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100668u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS1.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS1.
*/
#define GTM_ICM_IRQG_MCS1_CEI (GTM_ICM_IRQG_CEI_MCS1)

/** \brief 66C, ICM Interrupt Group MCS 2 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF010066Cu)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS2.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS2.
*/
#define GTM_ICM_IRQG_MCS2_CEI (GTM_ICM_IRQG_CEI_MCS2)

/** \brief 670, ICM Interrupt Group MCS 3 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100670u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS3.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS3.
*/
#define GTM_ICM_IRQG_MCS3_CEI (GTM_ICM_IRQG_CEI_MCS3)

/** \brief 674, ICM Interrupt Group MCS 4 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100674u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS4.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS4.
*/
#define GTM_ICM_IRQG_MCS4_CEI (GTM_ICM_IRQG_CEI_MCS4)

/** \brief 678, ICM Interrupt Group MCS 5 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100678u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS5.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS5.
*/
#define GTM_ICM_IRQG_MCS5_CEI (GTM_ICM_IRQG_CEI_MCS5)

/** \brief 67C, ICM Interrupt Group MCS 6 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF010067Cu)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS6.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS6.
*/
#define GTM_ICM_IRQG_MCS6_CEI (GTM_ICM_IRQG_CEI_MCS6)

/** \brief 680, ICM Interrupt Group MCS 7 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100680u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS7.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS7.
*/
#define GTM_ICM_IRQG_MCS7_CEI (GTM_ICM_IRQG_CEI_MCS7)

/** \brief 684, ICM Interrupt Group MCS 8 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS8 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100684u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS8.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS8.
*/
#define GTM_ICM_IRQG_MCS8_CEI (GTM_ICM_IRQG_CEI_MCS8)

/** \brief 688, ICM Interrupt Group MCS 9 for Channel Error Interrupt information */
#define GTM_ICM_IRQG_CEI_MCS9 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_MCS*)0xF0100688u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_MCS9.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_MCS9.
*/
#define GTM_ICM_IRQG_MCS9_CEI (GTM_ICM_IRQG_CEI_MCS9)

/** \brief 6A4, ICM Interrupt Group PSM 0 for Channel Error Interrupt information of FIFO0, FIFO1, FIFO2 */
#define GTM_ICM_IRQG_CEI_PSM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_PSM*)0xF01006A4u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_PSM0.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_PSM0.
*/
#define GTM_ICM_IRQG_PSM_0_CEI (GTM_ICM_IRQG_CEI_PSM0)

/** \brief 6B4, ICM Interrupt Group SPE for Module Error Interrupt Information */
#define GTM_ICM_IRQG_CEI_SPE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI_SPE*)0xF01006B4u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_CEI_SPE.
* To use register names with standard convension, please use GTM_ICM_IRQG_CEI_SPE.
*/
#define GTM_ICM_IRQG_SPE_CEI (GTM_ICM_IRQG_CEI_SPE)

/** \brief 710, ICM Interrupt Group k for Module Error Interrupt Information for each TIMm, MCSm, SPEm, FIFOm */
#define GTM_ICM_IRQG_MEI_CLS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ICM_IRQG_MEI_CLS*)0xF0100710u)
/** Alias (User Manual Name) for GTM_ICM_IRQG_MEI_CLS0.
* To use register names with standard convension, please use GTM_ICM_IRQG_MEI_CLS0.
*/
#define GTM_ICM_IRQG_CLS_0_MEI (GTM_ICM_IRQG_MEI_CLS0)

