Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 900, SPE2 Control Status Register */
#define GTM_SPE2_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100900u)

/** \brief 904, SPE2 Input Pattern Definition Register */
#define GTM_SPE2_PAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_PAT*)0xF0100904u)

/** \brief 908, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100908u)

/** \brief 90C, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010090Cu)

/** \brief 910, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100910u)

/** \brief 914, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100914u)

/** \brief 918, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100918u)

/** \brief 91C, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010091Cu)

/** \brief 920, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100920u)

/** \brief 924, SPE2 Output Definition Register z */
#define GTM_SPE2_OUT_PAT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100924u)

/** \brief 928, SPE2 Output Control Register */
#define GTM_SPE2_OUT_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF0100928u)

/** \brief 92C, SPE2 Interrupt Notification Register */
#define GTM_SPE2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF010092Cu)

/** \brief 930, SPE2 Interrupt Enable Register */
#define GTM_SPE2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF0100930u)

/** \brief 934, SPE2 Interrupt Generation by Software */
#define GTM_SPE2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT*)0xF0100934u)

/** \brief 938, SPE2 Interrupt Mode Configuration Register */
#define GTM_SPE2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE*)0xF0100938u)

/** \brief 93C, SPE2 Error Interrupt Enable Register */
#define GTM_SPE2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN*)0xF010093Cu)

/** \brief 940, SPE2 Input Revolution Counter */
#define GTM_SPE2_REV_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CNT*)0xF0100940u)

/** \brief 944, SPE2 Revolution Counter Compare Value */
#define GTM_SPE2_REV_CMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CMP*)0xF0100944u)

/** \brief 948, SPE2 Control Status Register 2 */
#define GTM_SPE2_CTRL_STAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2*)0xF0100948u)

/** \brief 94C, SPE2 Command register */
#define GTM_SPE2_CMD /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CMD*)0xF010094Cu)

/** \brief 980, SPE3 Control Status Register */
#define GTM_SPE3_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100980u)

/** \brief 984, SPE3 Input Pattern Definition Register */
#define GTM_SPE3_PAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_PAT*)0xF0100984u)

/** \brief 988, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100988u)

/** \brief 98C, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010098Cu)

/** \brief 990, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100990u)

/** \brief 994, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100994u)

/** \brief 998, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100998u)

/** \brief 99C, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010099Cu)

/** \brief 9A0, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF01009A0u)

/** \brief 9A4, SPE3 Output Definition Register z */
#define GTM_SPE3_OUT_PAT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF01009A4u)

/** \brief 9A8, SPE3 Output Control Register */
#define GTM_SPE3_OUT_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF01009A8u)

/** \brief 9AC, SPE3 Interrupt Notification Register */
#define GTM_SPE3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF01009ACu)

/** \brief 9B0, SPE3 Interrupt Enable Register */
#define GTM_SPE3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF01009B0u)

/** \brief 9B4, SPE3 Interrupt Generation by Software */
#define GTM_SPE3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT*)0xF01009B4u)

/** \brief 9B8, SPE3 Interrupt Mode Configuration Register */
#define GTM_SPE3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE*)0xF01009B8u)

/** \brief 9BC, SPE3 Error Interrupt Enable Register */
#define GTM_SPE3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN*)0xF01009BCu)

/** \brief 9C0, SPE3 Input Revolution Counter */
#define GTM_SPE3_REV_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CNT*)0xF01009C0u)

/** \brief 9C4, SPE3 Revolution Counter Compare Value */
#define GTM_SPE3_REV_CMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CMP*)0xF01009C4u)

/** \brief 9C8, SPE3 Control Status Register 2 */
#define GTM_SPE3_CTRL_STAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2*)0xF01009C8u)

/** \brief 9CC, SPE3 Command register */
#define GTM_SPE3_CMD /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CMD*)0xF01009CCu)

/** \brief A00, SPE4 Control Status Register */
#define GTM_SPE4_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100A00u)

/** \brief A04, SPE4 Input Pattern Definition Register */
#define GTM_SPE4_PAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_PAT*)0xF0100A04u)

/** \brief A08, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A08u)

/** \brief A0C, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A0Cu)

/** \brief A10, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A10u)

/** \brief A14, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A14u)

