Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief A18, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A18u)

/** \brief A1C, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A1Cu)

/** \brief A20, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A20u)

/** \brief A24, SPE4 Output Definition Register z */
#define GTM_SPE4_OUT_PAT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A24u)

/** \brief A28, SPE4 Output Control Register */
#define GTM_SPE4_OUT_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF0100A28u)

/** \brief A2C, SPE4 Interrupt Notification Register */
#define GTM_SPE4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF0100A2Cu)

/** \brief A30, SPE4 Interrupt Enable Register */
#define GTM_SPE4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF0100A30u)

/** \brief A34, SPE4 Interrupt Generation by Software */
#define GTM_SPE4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT*)0xF0100A34u)

/** \brief A38, SPE4 Interrupt Mode Configuration Register */
#define GTM_SPE4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE*)0xF0100A38u)

/** \brief A3C, SPE4 Error Interrupt Enable Register */
#define GTM_SPE4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN*)0xF0100A3Cu)

/** \brief A40, SPE4 Input Revolution Counter */
#define GTM_SPE4_REV_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CNT*)0xF0100A40u)

/** \brief A44, SPE4 Revolution Counter Compare Value */
#define GTM_SPE4_REV_CMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CMP*)0xF0100A44u)

/** \brief A48, SPE4 Control Status Register 2 */
#define GTM_SPE4_CTRL_STAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2*)0xF0100A48u)

/** \brief A4C, SPE4 Command register */
#define GTM_SPE4_CMD /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CMD*)0xF0100A4Cu)

/** \brief A80, SPE5 Control Status Register */
#define GTM_SPE5_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100A80u)

/** \brief A84, SPE5 Input Pattern Definition Register */
#define GTM_SPE5_PAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_PAT*)0xF0100A84u)

/** \brief A88, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A88u)

/** \brief A8C, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A8Cu)

/** \brief A90, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A90u)

/** \brief A94, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A94u)

/** \brief A98, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A98u)

/** \brief A9C, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100A9Cu)

/** \brief AA0, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100AA0u)

/** \brief AA4, SPE5 Output Definition Register z */
#define GTM_SPE5_OUT_PAT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100AA4u)

/** \brief AA8, SPE5 Output Control Register */
#define GTM_SPE5_OUT_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF0100AA8u)

/** \brief AAC, SPE5 Interrupt Notification Register */
#define GTM_SPE5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF0100AACu)

/** \brief AB0, SPE5 Interrupt Enable Register */
#define GTM_SPE5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF0100AB0u)

/** \brief AB4, SPE5 Interrupt Generation by Software */
#define GTM_SPE5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT*)0xF0100AB4u)

/** \brief AB8, SPE5 Interrupt Mode Configuration Register */
#define GTM_SPE5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE*)0xF0100AB8u)

/** \brief ABC, SPE5 Error Interrupt Enable Register */
#define GTM_SPE5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN*)0xF0100ABCu)

/** \brief AC0, SPE5 Input Revolution Counter */
#define GTM_SPE5_REV_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CNT*)0xF0100AC0u)

/** \brief AC4, SPE5 Revolution Counter Compare Value */
#define GTM_SPE5_REV_CMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_REV_CMP*)0xF0100AC4u)

/** \brief AC8, SPE5 Control Status Register 2 */
#define GTM_SPE5_CTRL_STAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2*)0xF0100AC8u)

/** \brief ACC, SPE5 Command register */
#define GTM_SPE5_CMD /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_SPE_CMD*)0xF0100ACCu)

/** \brief F00, MAP Control Register */
#define GTM_MAP_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MAP_CTRL*)0xF0100F00u)

/** \brief F40, MCFG Memory Layout Configuration Register */
#define GTM_MCFG_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCFG_CTRL*)0xF0100F40u)

/** \brief 1000, TIM0 Channel 0 General Purpose 0 Register */
#define GTM_TIM0_CH0_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0101000u)

/** \brief 1004, TIM0 Channel 0 General Purpose 1 Register */
#define GTM_TIM0_CH0_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0101004u)

/** \brief 1008, TIM0 Channel 0 SMU Counter Register */
#define GTM_TIM0_CH0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0101008u)

/** \brief 100C, TIM0 Channel 0 SMU Edge Counter Register */
#define GTM_TIM0_CH0_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010100Cu)

