Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 3008, TIM4 Channel 0 SMU Counter Register */
#define GTM_TIM4_CH0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103008u)

/** \brief 300C, TIM4 Channel 0 SMU Edge Counter Register */
#define GTM_TIM4_CH0_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010300Cu)

/** \brief 3010, TIM4 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM4_CH0_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103010u)

/** \brief 3014, TIM4 Channel 0 TDU Counter Register */
#define GTM_TIM4_CH0_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103014u)

/** \brief 3018, TIM4 Channel 0 TDU Control Register */
#define GTM_TIM4_CH0_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103018u)

/** \brief 301C, TIM4 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM4_CH0_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010301Cu)

/** \brief 3020, TIM4 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM4_CH0_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103020u)

/** \brief 3024, TIM4 Channel 0 Control Register */
#define GTM_TIM4_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103024u)

/** \brief 3028, TIM4 Channel 0 Extended Control Register */
#define GTM_TIM4_CH0_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103028u)

/** \brief 302C, TIM4 Channel 0 Interrupt Notification Register */
#define GTM_TIM4_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010302Cu)

/** \brief 3030, TIM4 Channel 0 Interrupt Enable Register */
#define GTM_TIM4_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103030u)

/** \brief 3034, TIM4 Channel 0 Force Interrupt Register */
#define GTM_TIM4_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103034u)

/** \brief 3038, TIM4 Channel 0 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103038u)

/** \brief 303C, TIM4 Channel 0 Error Interrupt Enable Register */
#define GTM_TIM4_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010303Cu)

/** \brief 3074, TIM4 Input Value Observation Register */
#define GTM_TIM4_INP_VAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_INP_VAL*)0xF0103074u)

/** \brief 3078, TIM4 AUX IN Source Selection Register */
#define GTM_TIM4_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0103078u)

/** \brief 307C, TIM4 Global Software Reset Register */
#define GTM_TIM4_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010307Cu)

/** \brief 3080, TIM4 Channel 1 General Purpose 0 Register */
#define GTM_TIM4_CH1_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103080u)

/** \brief 3084, TIM4 Channel 1 General Purpose 1 Register */
#define GTM_TIM4_CH1_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103084u)

/** \brief 3088, TIM4 Channel 1 SMU Counter Register */
#define GTM_TIM4_CH1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103088u)

/** \brief 308C, TIM4 Channel 1 SMU Edge Counter Register */
#define GTM_TIM4_CH1_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010308Cu)

/** \brief 3090, TIM4 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM4_CH1_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103090u)

/** \brief 3094, TIM4 Channel 1 TDU Counter Register */
#define GTM_TIM4_CH1_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103094u)

/** \brief 3098, TIM4 Channel 1 TDU Control Register */
#define GTM_TIM4_CH1_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103098u)

/** \brief 309C, TIM4 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM4_CH1_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010309Cu)

/** \brief 30A0, TIM4 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM4_CH1_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01030A0u)

/** \brief 30A4, TIM4 Channel 1 Control Register */
#define GTM_TIM4_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01030A4u)

/** \brief 30A8, TIM4 Channel 1 Extended Control Register */
#define GTM_TIM4_CH1_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01030A8u)

/** \brief 30AC, TIM4 Channel 1 Interrupt Notification Register */
#define GTM_TIM4_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01030ACu)

/** \brief 30B0, TIM4 Channel 1 Interrupt Enable Register */
#define GTM_TIM4_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01030B0u)

/** \brief 30B4, TIM4 Channel 1 Force Interrupt Register */
#define GTM_TIM4_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01030B4u)

/** \brief 30B8, TIM4 Channel 1 Interrupt Mode Configuration Register */
#define GTM_TIM4_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01030B8u)

/** \brief 30BC, TIM4 Channel 1 Error Interrupt Enable Register */
#define GTM_TIM4_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01030BCu)

/** \brief 3100, TIM4 Channel 2 General Purpose 0 Register */
#define GTM_TIM4_CH2_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103100u)

/** \brief 3104, TIM4 Channel 2 General Purpose 1 Register */
#define GTM_TIM4_CH2_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103104u)

/** \brief 3108, TIM4 Channel 2 SMU Counter Register */
#define GTM_TIM4_CH2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103108u)

/** \brief 310C, TIM4 Channel 2 SMU Edge Counter Register */
#define GTM_TIM4_CH2_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010310Cu)

/** \brief 3110, TIM4 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM4_CH2_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103110u)

