Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 4800, TIM7 Channel 0 General Purpose 0 Register */
#define GTM_TIM7_CH0_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104800u)

/** \brief 4804, TIM7 Channel 0 General Purpose 1 Register */
#define GTM_TIM7_CH0_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104804u)

/** \brief 4808, TIM7 Channel 0 SMU Counter Register */
#define GTM_TIM7_CH0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104808u)

/** \brief 480C, TIM7 Channel 0 SMU Edge Counter Register */
#define GTM_TIM7_CH0_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010480Cu)

/** \brief 4810, TIM7 Channel 0 SMU Shadow Counter Register */
#define GTM_TIM7_CH0_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104810u)

/** \brief 4814, TIM7 Channel 0 TDU Counter Register */
#define GTM_TIM7_CH0_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104814u)

/** \brief 4818, TIM7 Channel 0 TDU Control Register */
#define GTM_TIM7_CH0_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104818u)

/** \brief 481C, TIM7 Channel 0 Filter Parameter 0 Register */
#define GTM_TIM7_CH0_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010481Cu)

/** \brief 4820, TIM7 Channel 0 Filter Parameter 1 Register */
#define GTM_TIM7_CH0_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0104820u)

/** \brief 4824, TIM7 Channel 0 Control Register */
#define GTM_TIM7_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0104824u)

/** \brief 4828, TIM7 Channel 0 Extended Control Register */
#define GTM_TIM7_CH0_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0104828u)

/** \brief 482C, TIM7 Channel 0 Interrupt Notification Register */
#define GTM_TIM7_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010482Cu)

/** \brief 4830, TIM7 Channel 0 Interrupt Enable Register */
#define GTM_TIM7_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0104830u)

/** \brief 4834, TIM7 Channel 0 Force Interrupt Register */
#define GTM_TIM7_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0104834u)

/** \brief 4838, TIM7 Channel 0 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0104838u)

/** \brief 483C, TIM7 Channel 0 Error Interrupt Enable Register */
#define GTM_TIM7_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010483Cu)

/** \brief 4874, TIM7 Input Value Observation Register */
#define GTM_TIM7_INP_VAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_INP_VAL*)0xF0104874u)

/** \brief 4878, TIM7 AUX IN Source Selection Register */
#define GTM_TIM7_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0104878u)

/** \brief 487C, TIM7 Global Software Reset Register */
#define GTM_TIM7_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010487Cu)

/** \brief 4880, TIM7 Channel 1 General Purpose 0 Register */
#define GTM_TIM7_CH1_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104880u)

/** \brief 4884, TIM7 Channel 1 General Purpose 1 Register */
#define GTM_TIM7_CH1_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104884u)

/** \brief 4888, TIM7 Channel 1 SMU Counter Register */
#define GTM_TIM7_CH1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104888u)

/** \brief 488C, TIM7 Channel 1 SMU Edge Counter Register */
#define GTM_TIM7_CH1_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010488Cu)

/** \brief 4890, TIM7 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM7_CH1_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104890u)

/** \brief 4894, TIM7 Channel 1 TDU Counter Register */
#define GTM_TIM7_CH1_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0104894u)

/** \brief 4898, TIM7 Channel 1 TDU Control Register */
#define GTM_TIM7_CH1_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0104898u)

/** \brief 489C, TIM7 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM7_CH1_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010489Cu)

/** \brief 48A0, TIM7 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM7_CH1_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01048A0u)

/** \brief 48A4, TIM7 Channel 1 Control Register */
#define GTM_TIM7_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01048A4u)

/** \brief 48A8, TIM7 Channel 1 Extended Control Register */
#define GTM_TIM7_CH1_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01048A8u)

/** \brief 48AC, TIM7 Channel 1 Interrupt Notification Register */
#define GTM_TIM7_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01048ACu)

/** \brief 48B0, TIM7 Channel 1 Interrupt Enable Register */
#define GTM_TIM7_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01048B0u)

/** \brief 48B4, TIM7 Channel 1 Force Interrupt Register */
#define GTM_TIM7_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01048B4u)

/** \brief 48B8, TIM7 Channel 1 Interrupt Mode Configuration Register */
#define GTM_TIM7_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01048B8u)

/** \brief 48BC, TIM7 Channel 1 Error Interrupt Enable Register */
#define GTM_TIM7_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01048BCu)

/** \brief 4900, TIM7 Channel 2 General Purpose 0 Register */
#define GTM_TIM7_CH2_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0104900u)

/** \brief 4904, TIM7 Channel 2 General Purpose 1 Register */
#define GTM_TIM7_CH2_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0104904u)

/** \brief 4908, TIM7 Channel 2 SMU Counter Register */
#define GTM_TIM7_CH2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0104908u)

/** \brief 490C, TIM7 Channel 2 SMU Edge Counter Register */
#define GTM_TIM7_CH2_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010490Cu)

/** \brief 4910, TIM7 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM7_CH2_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0104910u)

