Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 9364, TOM2 Channel 13 Force Interrupt Register */
#define GTM_TOM2_CH13_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109364u)

/** \brief 9368, TOM2 Channel 13 Interrupt Mode Register */
#define GTM_TOM2_CH13_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109368u)

/** \brief 9380, TOM2 Channel 14 Control Register */
#define GTM_TOM2_CH14_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109380u)

/** \brief 9384, TOM2 Channel 14 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH14_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109384u)

/** \brief 9388, TOM2 Channel 14 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH14_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109388u)

/** \brief 938C, TOM2 Channel 14 CCU0 Compare Register */
#define GTM_TOM2_CH14_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010938Cu)

/** \brief 9390, TOM2 Channel 14 CCU1 Compare Register */
#define GTM_TOM2_CH14_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109390u)

/** \brief 9394, TOM2 Channel 14 CCU0 Counter Register */
#define GTM_TOM2_CH14_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109394u)

/** \brief 9398, TOM2 Channel 14 Status Register */
#define GTM_TOM2_CH14_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109398u)

/** \brief 939C, TOM2 Channel 14 Interrupt Notification Register */
#define GTM_TOM2_CH14_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010939Cu)

/** \brief 93A0, TOM2 Channel 14 Interrupt Enable Register */
#define GTM_TOM2_CH14_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01093A0u)

/** \brief 93A4, TOM2 Channel 14 Force Interrupt Register */
#define GTM_TOM2_CH14_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01093A4u)

/** \brief 93A8, TOM2 Channel 14 Interrupt Mode Register */
#define GTM_TOM2_CH14_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01093A8u)

/** \brief 93C0, TOM2 Channel 15 Control Register */
#define GTM_TOM2_CH15_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01093C0u)

/** \brief 93C4, TOM2 Channel 15 CCU0 Compare Shadow Register */
#define GTM_TOM2_CH15_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01093C4u)

/** \brief 93C8, TOM2 Channel 15 CCU1 Compare Shadow Register */
#define GTM_TOM2_CH15_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01093C8u)

/** \brief 93CC, TOM2 Channel 15 CCU0 Compare Register */
#define GTM_TOM2_CH15_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01093CCu)

/** \brief 93D0, TOM2 Channel 15 CCU1 Compare Register */
#define GTM_TOM2_CH15_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01093D0u)

/** \brief 93D4, TOM2 Channel 15 CCU0 Counter Register */
#define GTM_TOM2_CH15_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01093D4u)

/** \brief 93D8, TOM2 Channel 15 Status Register */
#define GTM_TOM2_CH15_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01093D8u)

/** \brief 93DC, TOM2 Channel 15 Interrupt Notification Register */
#define GTM_TOM2_CH15_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01093DCu)

/** \brief 93E0, TOM2 Channel 15 Interrupt Enable Register */
#define GTM_TOM2_CH15_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01093E0u)

/** \brief 93E4, TOM2 Channel 15 Force Interrupt Register */
#define GTM_TOM2_CH15_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01093E4u)

/** \brief 93E8, TOM2 Channel 15 Interrupt Mode Register */
#define GTM_TOM2_CH15_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01093E8u)

/** \brief 9800, TOM3 Channel 0 Control Register */
#define GTM_TOM3_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109800u)

/** \brief 9804, TOM3 Channel 0 CCU0 Compare Shadow Register */
#define GTM_TOM3_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109804u)

/** \brief 9808, TOM3 Channel 0 CCU1 Compare Shadow Register */
#define GTM_TOM3_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109808u)

/** \brief 980C, TOM3 Channel 0 CCU0 Compare Register */
#define GTM_TOM3_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010980Cu)

/** \brief 9810, TOM3 Channel 0 CCU1 Compare Register */
#define GTM_TOM3_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109810u)

/** \brief 9814, TOM3 Channel 0 CCU0 Counter Register */
#define GTM_TOM3_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109814u)

/** \brief 9818, TOM3 Channel 0 Status Register */
#define GTM_TOM3_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109818u)

/** \brief 981C, TOM3 Channel 0 Interrupt Notification Register */
#define GTM_TOM3_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010981Cu)

/** \brief 9820, TOM3 Channel 0 Interrupt Enable Register */
#define GTM_TOM3_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109820u)

/** \brief 9824, TOM3 Channel 0 Force Interrupt Register */
#define GTM_TOM3_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109824u)

/** \brief 9828, TOM3 Channel 0 Interrupt Mode Register */
#define GTM_TOM3_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109828u)

/** \brief 9830, TOM3 TGC0 Global Control Register */
#define GTM_TOM3_TGC0_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF0109830u)

/** \brief 9834, TOM3 TGC0 Action Time Base Register */
#define GTM_TOM3_TGC0_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF0109834u)

/** \brief 9838, TOM3 TGC0 Force Update Control Register */
#define GTM_TOM3_TGC0_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF0109838u)

/** \brief 983C, TOM3 TGC0 Internal Trigger Control Register */
#define GTM_TOM3_TGC0_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010983Cu)

/** \brief 9840, TOM3 Channel 1 Control Register */
#define GTM_TOM3_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109840u)

