Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief A084, TOM4 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A084u)

/** \brief A088, TOM4 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A088u)

/** \brief A08C, TOM4 Channel 2 CCU0 Compare Register */
#define GTM_TOM4_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A08Cu)

/** \brief A090, TOM4 Channel 2 CCU1 Compare Register */
#define GTM_TOM4_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A090u)

/** \brief A094, TOM4 Channel 2 CCU0 Counter Register */
#define GTM_TOM4_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A094u)

/** \brief A098, TOM4 Channel 2 Status Register */
#define GTM_TOM4_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A098u)

/** \brief A09C, TOM4 Channel 2 Interrupt Notification Register */
#define GTM_TOM4_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A09Cu)

/** \brief A0A0, TOM4 Channel 2 Interrupt Enable Register */
#define GTM_TOM4_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A0A0u)

/** \brief A0A4, TOM4 Channel 2 Force Interrupt Register */
#define GTM_TOM4_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A0A4u)

/** \brief A0A8, TOM4 Channel 2 Interrupt Mode Register */
#define GTM_TOM4_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A0A8u)

/** \brief A0C0, TOM4 Channel 3 Control Register */
#define GTM_TOM4_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A0C0u)

/** \brief A0C4, TOM4 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A0C4u)

/** \brief A0C8, TOM4 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A0C8u)

/** \brief A0CC, TOM4 Channel 3 CCU0 Compare Register */
#define GTM_TOM4_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A0CCu)

/** \brief A0D0, TOM4 Channel 3 CCU1 Compare Register */
#define GTM_TOM4_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A0D0u)

/** \brief A0D4, TOM4 Channel 3 CCU0 Counter Register */
#define GTM_TOM4_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A0D4u)

/** \brief A0D8, TOM4 Channel 3 Status Register */
#define GTM_TOM4_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A0D8u)

/** \brief A0DC, TOM4 Channel 3 Interrupt Notification Register */
#define GTM_TOM4_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A0DCu)

/** \brief A0E0, TOM4 Channel 3 Interrupt Enable Register */
#define GTM_TOM4_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A0E0u)

/** \brief A0E4, TOM4 Channel 3 Force Interrupt Register */
#define GTM_TOM4_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A0E4u)

/** \brief A0E8, TOM4 Channel 3 Interrupt Mode Register */
#define GTM_TOM4_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A0E8u)

/** \brief A100, TOM4 Channel 4 Control Register */
#define GTM_TOM4_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A100u)

/** \brief A104, TOM4 Channel 4 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A104u)

/** \brief A108, TOM4 Channel 4 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A108u)

/** \brief A10C, TOM4 Channel 4 CCU0 Compare Register */
#define GTM_TOM4_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A10Cu)

/** \brief A110, TOM4 Channel 4 CCU1 Compare Register */
#define GTM_TOM4_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A110u)

/** \brief A114, TOM4 Channel 4 CCU0 Counter Register */
#define GTM_TOM4_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A114u)

/** \brief A118, TOM4 Channel 4 Status Register */
#define GTM_TOM4_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A118u)

/** \brief A11C, TOM4 Channel 4 Interrupt Notification Register */
#define GTM_TOM4_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A11Cu)

/** \brief A120, TOM4 Channel 4 Interrupt Enable Register */
#define GTM_TOM4_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A120u)

/** \brief A124, TOM4 Channel 4 Force Interrupt Register */
#define GTM_TOM4_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A124u)

/** \brief A128, TOM4 Channel 4 Interrupt Mode Register */
#define GTM_TOM4_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A128u)

/** \brief A140, TOM4 Channel 5 Control Register */
#define GTM_TOM4_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A140u)

/** \brief A144, TOM4 Channel 5 CCU0 Compare Shadow Register */
#define GTM_TOM4_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A144u)

/** \brief A148, TOM4 Channel 5 CCU1 Compare Shadow Register */
#define GTM_TOM4_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A148u)

/** \brief A14C, TOM4 Channel 5 CCU0 Compare Register */
#define GTM_TOM4_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A14Cu)

/** \brief A150, TOM4 Channel 5 CCU1 Compare Register */
#define GTM_TOM4_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A150u)

/** \brief A154, TOM4 Channel 5 CCU0 Counter Register */
#define GTM_TOM4_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A154u)

/** \brief A158, TOM4 Channel 5 Status Register */
#define GTM_TOM4_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A158u)

/** \brief A15C, TOM4 Channel 5 Interrupt Notification Register */
#define GTM_TOM4_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A15Cu)

/** \brief A160, TOM4 Channel 5 Interrupt Enable Register */
#define GTM_TOM4_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A160u)

