Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief A828, TOM5 Channel 0 Interrupt Mode Register */
#define GTM_TOM5_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A828u)

/** \brief A830, TOM5 TGC0 Global Control Register */
#define GTM_TOM5_TGC0_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF010A830u)

/** \brief A834, TOM5 TGC0 Action Time Base Register */
#define GTM_TOM5_TGC0_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010A834u)

/** \brief A838, TOM5 TGC0 Force Update Control Register */
#define GTM_TOM5_TGC0_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF010A838u)

/** \brief A83C, TOM5 TGC0 Internal Trigger Control Register */
#define GTM_TOM5_TGC0_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010A83Cu)

/** \brief A840, TOM5 Channel 1 Control Register */
#define GTM_TOM5_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A840u)

/** \brief A844, TOM5 Channel 1 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A844u)

/** \brief A848, TOM5 Channel 1 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A848u)

/** \brief A84C, TOM5 Channel 1 CCU0 Compare Register */
#define GTM_TOM5_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A84Cu)

/** \brief A850, TOM5 Channel 1 CCU1 Compare Register */
#define GTM_TOM5_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A850u)

/** \brief A854, TOM5 Channel 1 CCU0 Counter Register */
#define GTM_TOM5_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A854u)

/** \brief A858, TOM5 Channel 1 Status Register */
#define GTM_TOM5_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A858u)

/** \brief A85C, TOM5 Channel 1 Interrupt Notification Register */
#define GTM_TOM5_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A85Cu)

/** \brief A860, TOM5 Channel 1 Interrupt Enable Register */
#define GTM_TOM5_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A860u)

/** \brief A864, TOM5 Channel 1 Force Interrupt Register */
#define GTM_TOM5_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A864u)

/** \brief A868, TOM5 Channel 1 Interrupt Mode Register */
#define GTM_TOM5_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A868u)

/** \brief A870, TOM5 TGC0 Enable/Disable Control Register */
#define GTM_TOM5_TGC0_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF010A870u)

/** \brief A874, TOM5 TGC0 Enable/Disable Status Register */
#define GTM_TOM5_TGC0_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF010A874u)

/** \brief A878, TOM5 TGC0 Output Enable Control Register */
#define GTM_TOM5_TGC0_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF010A878u)

/** \brief A87C, TOM5 TGC0 Output Enable Status Register */
#define GTM_TOM5_TGC0_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF010A87Cu)

/** \brief A880, TOM5 Channel 2 Control Register */
#define GTM_TOM5_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A880u)

/** \brief A884, TOM5 Channel 2 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH2_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A884u)

/** \brief A888, TOM5 Channel 2 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH2_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A888u)

/** \brief A88C, TOM5 Channel 2 CCU0 Compare Register */
#define GTM_TOM5_CH2_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A88Cu)

/** \brief A890, TOM5 Channel 2 CCU1 Compare Register */
#define GTM_TOM5_CH2_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A890u)

/** \brief A894, TOM5 Channel 2 CCU0 Counter Register */
#define GTM_TOM5_CH2_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A894u)

/** \brief A898, TOM5 Channel 2 Status Register */
#define GTM_TOM5_CH2_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A898u)

/** \brief A89C, TOM5 Channel 2 Interrupt Notification Register */
#define GTM_TOM5_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A89Cu)

/** \brief A8A0, TOM5 Channel 2 Interrupt Enable Register */
#define GTM_TOM5_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A8A0u)

/** \brief A8A4, TOM5 Channel 2 Force Interrupt Register */
#define GTM_TOM5_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A8A4u)

/** \brief A8A8, TOM5 Channel 2 Interrupt Mode Register */
#define GTM_TOM5_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A8A8u)

/** \brief A8C0, TOM5 Channel 3 Control Register */
#define GTM_TOM5_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A8C0u)

/** \brief A8C4, TOM5 Channel 3 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A8C4u)

/** \brief A8C8, TOM5 Channel 3 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A8C8u)

/** \brief A8CC, TOM5 Channel 3 CCU0 Compare Register */
#define GTM_TOM5_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A8CCu)

/** \brief A8D0, TOM5 Channel 3 CCU1 Compare Register */
#define GTM_TOM5_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A8D0u)

/** \brief A8D4, TOM5 Channel 3 CCU0 Counter Register */
#define GTM_TOM5_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A8D4u)

/** \brief A8D8, TOM5 Channel 3 Status Register */
#define GTM_TOM5_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A8D8u)

/** \brief A8DC, TOM5 Channel 3 Interrupt Notification Register */
#define GTM_TOM5_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A8DCu)

