Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief A9D4, TOM5 Channel 7 CCU0 Counter Register */
#define GTM_TOM5_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A9D4u)

/** \brief A9D8, TOM5 Channel 7 Status Register */
#define GTM_TOM5_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A9D8u)

/** \brief A9DC, TOM5 Channel 7 Interrupt Notification Register */
#define GTM_TOM5_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A9DCu)

/** \brief A9E0, TOM5 Channel 7 Interrupt Enable Register */
#define GTM_TOM5_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A9E0u)

/** \brief A9E4, TOM5 Channel 7 Force Interrupt Register */
#define GTM_TOM5_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A9E4u)

/** \brief A9E8, TOM5 Channel 7 Interrupt Mode Register */
#define GTM_TOM5_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A9E8u)

/** \brief AA00, TOM5 Channel 8 Control Register */
#define GTM_TOM5_CH8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AA00u)

/** \brief AA04, TOM5 Channel 8 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH8_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AA04u)

/** \brief AA08, TOM5 Channel 8 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH8_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AA08u)

/** \brief AA0C, TOM5 Channel 8 CCU0 Compare Register */
#define GTM_TOM5_CH8_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AA0Cu)

/** \brief AA10, TOM5 Channel 8 CCU1 Compare Register */
#define GTM_TOM5_CH8_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AA10u)

/** \brief AA14, TOM5 Channel 8 CCU0 Counter Register */
#define GTM_TOM5_CH8_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AA14u)

/** \brief AA18, TOM5 Channel 8 Status Register */
#define GTM_TOM5_CH8_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AA18u)

/** \brief AA1C, TOM5 Channel 8 Interrupt Notification Register */
#define GTM_TOM5_CH8_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AA1Cu)

/** \brief AA20, TOM5 Channel 8 Interrupt Enable Register */
#define GTM_TOM5_CH8_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AA20u)

/** \brief AA24, TOM5 Channel 8 Force Interrupt Register */
#define GTM_TOM5_CH8_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AA24u)

/** \brief AA28, TOM5 Channel 8 Interrupt Mode Register */
#define GTM_TOM5_CH8_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010AA28u)

/** \brief AA30, TOM5 TGC1 Global Control Register */
#define GTM_TOM5_TGC1_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF010AA30u)

/** \brief AA34, TOM5 TGC1 Action Time Base Register */
#define GTM_TOM5_TGC1_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010AA34u)

/** \brief AA38, TOM5 TGC1 Force Update Control Register */
#define GTM_TOM5_TGC1_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF010AA38u)

/** \brief AA3C, TOM5 TGC1 Internal Trigger Control Register */
#define GTM_TOM5_TGC1_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010AA3Cu)

/** \brief AA40, TOM5 Channel 9 Control Register */
#define GTM_TOM5_CH9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AA40u)

/** \brief AA44, TOM5 Channel 9 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH9_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AA44u)

/** \brief AA48, TOM5 Channel 9 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH9_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AA48u)

/** \brief AA4C, TOM5 Channel 9 CCU0 Compare Register */
#define GTM_TOM5_CH9_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AA4Cu)

/** \brief AA50, TOM5 Channel 9 CCU1 Compare Register */
#define GTM_TOM5_CH9_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AA50u)

/** \brief AA54, TOM5 Channel 9 CCU0 Counter Register */
#define GTM_TOM5_CH9_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AA54u)

/** \brief AA58, TOM5 Channel 9 Status Register */
#define GTM_TOM5_CH9_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AA58u)

/** \brief AA5C, TOM5 Channel 9 Interrupt Notification Register */
#define GTM_TOM5_CH9_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AA5Cu)

/** \brief AA60, TOM5 Channel 9 Interrupt Enable Register */
#define GTM_TOM5_CH9_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AA60u)

/** \brief AA64, TOM5 Channel 9 Force Interrupt Register */
#define GTM_TOM5_CH9_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AA64u)

/** \brief AA68, TOM5 Channel 9 Interrupt Mode Register */
#define GTM_TOM5_CH9_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010AA68u)

/** \brief AA70, TOM5 TGC1 Enable/Disable Control Register */
#define GTM_TOM5_TGC1_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF010AA70u)

/** \brief AA74, TOM5 TGC1 Enable/Disable Status Register */
#define GTM_TOM5_TGC1_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF010AA74u)

/** \brief AA78, TOM5 TGC1 Output Enable Control Register */
#define GTM_TOM5_TGC1_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF010AA78u)

/** \brief AA7C, TOM5 TGC1 Output Enable Status Register */
#define GTM_TOM5_TGC1_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF010AA7Cu)

/** \brief AA80, TOM5 Channel 10 Control Register */
#define GTM_TOM5_CH10_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AA80u)

/** \brief AA84, TOM5 Channel 10 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH10_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AA84u)

/** \brief AA88, TOM5 Channel 10 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH10_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AA88u)

/** \brief AA8C, TOM5 Channel 10 CCU0 Compare Register */
#define GTM_TOM5_CH10_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AA8Cu)

