Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief AA90, TOM5 Channel 10 CCU1 Compare Register */
#define GTM_TOM5_CH10_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AA90u)

/** \brief AA94, TOM5 Channel 10 CCU0 Counter Register */
#define GTM_TOM5_CH10_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AA94u)

/** \brief AA98, TOM5 Channel 10 Status Register */
#define GTM_TOM5_CH10_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AA98u)

/** \brief AA9C, TOM5 Channel 10 Interrupt Notification Register */
#define GTM_TOM5_CH10_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AA9Cu)

/** \brief AAA0, TOM5 Channel 10 Interrupt Enable Register */
#define GTM_TOM5_CH10_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AAA0u)

/** \brief AAA4, TOM5 Channel 10 Force Interrupt Register */
#define GTM_TOM5_CH10_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AAA4u)

/** \brief AAA8, TOM5 Channel 10 Interrupt Mode Register */
#define GTM_TOM5_CH10_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010AAA8u)

/** \brief AAC0, TOM5 Channel 11 Control Register */
#define GTM_TOM5_CH11_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AAC0u)

/** \brief AAC4, TOM5 Channel 11 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH11_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AAC4u)

/** \brief AAC8, TOM5 Channel 11 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH11_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AAC8u)

/** \brief AACC, TOM5 Channel 11 CCU0 Compare Register */
#define GTM_TOM5_CH11_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AACCu)

/** \brief AAD0, TOM5 Channel 11 CCU1 Compare Register */
#define GTM_TOM5_CH11_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AAD0u)

/** \brief AAD4, TOM5 Channel 11 CCU0 Counter Register */
#define GTM_TOM5_CH11_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AAD4u)

/** \brief AAD8, TOM5 Channel 11 Status Register */
#define GTM_TOM5_CH11_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AAD8u)

/** \brief AADC, TOM5 Channel 11 Interrupt Notification Register */
#define GTM_TOM5_CH11_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AADCu)

/** \brief AAE0, TOM5 Channel 11 Interrupt Enable Register */
#define GTM_TOM5_CH11_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AAE0u)

/** \brief AAE4, TOM5 Channel 11 Force Interrupt Register */
#define GTM_TOM5_CH11_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AAE4u)

/** \brief AAE8, TOM5 Channel 11 Interrupt Mode Register */
#define GTM_TOM5_CH11_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010AAE8u)

/** \brief AB00, TOM5 Channel 12 Control Register */
#define GTM_TOM5_CH12_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AB00u)

/** \brief AB04, TOM5 Channel 12 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH12_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AB04u)

/** \brief AB08, TOM5 Channel 12 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH12_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AB08u)

/** \brief AB0C, TOM5 Channel 12 CCU0 Compare Register */
#define GTM_TOM5_CH12_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AB0Cu)

/** \brief AB10, TOM5 Channel 12 CCU1 Compare Register */
#define GTM_TOM5_CH12_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AB10u)

/** \brief AB14, TOM5 Channel 12 CCU0 Counter Register */
#define GTM_TOM5_CH12_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AB14u)

/** \brief AB18, TOM5 Channel 12 Status Register */
#define GTM_TOM5_CH12_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AB18u)

/** \brief AB1C, TOM5 Channel 12 Interrupt Notification Register */
#define GTM_TOM5_CH12_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AB1Cu)

/** \brief AB20, TOM5 Channel 12 Interrupt Enable Register */
#define GTM_TOM5_CH12_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AB20u)

/** \brief AB24, TOM5 Channel 12 Force Interrupt Register */
#define GTM_TOM5_CH12_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AB24u)

/** \brief AB28, TOM5 Channel 12 Interrupt Mode Register */
#define GTM_TOM5_CH12_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010AB28u)

/** \brief AB40, TOM5 Channel 13 Control Register */
#define GTM_TOM5_CH13_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010AB40u)

/** \brief AB44, TOM5 Channel 13 CCU0 Compare Shadow Register */
#define GTM_TOM5_CH13_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010AB44u)

/** \brief AB48, TOM5 Channel 13 CCU1 Compare Shadow Register */
#define GTM_TOM5_CH13_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010AB48u)

/** \brief AB4C, TOM5 Channel 13 CCU0 Compare Register */
#define GTM_TOM5_CH13_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010AB4Cu)

/** \brief AB50, TOM5 Channel 13 CCU1 Compare Register */
#define GTM_TOM5_CH13_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010AB50u)

/** \brief AB54, TOM5 Channel 13 CCU0 Counter Register */
#define GTM_TOM5_CH13_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010AB54u)

/** \brief AB58, TOM5 Channel 13 Status Register */
#define GTM_TOM5_CH13_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010AB58u)

/** \brief AB5C, TOM5 Channel 13 Interrupt Notification Register */
#define GTM_TOM5_CH13_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010AB5Cu)

/** \brief AB60, TOM5 Channel 13 Interrupt Enable Register */
#define GTM_TOM5_CH13_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010AB60u)

/** \brief AB64, TOM5 Channel 13 Force Interrupt Register */
#define GTM_TOM5_CH13_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010AB64u)

