Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 1C4AC, FIFO1 Channel 2 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C4ACu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH2_IRQ_FORCINT (GTM_PSM1_FIFO_CH2_IRQ_FORCINT)

/** \brief 1C4B0, FIFO1 Channel 2 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C4B0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_IRQ_MODE.
*/
#define GTM_FIFO1_CH2_IRQ_MODE (GTM_PSM1_FIFO_CH2_IRQ_MODE)

/** \brief 1C4B4, FIFO1 Channel 2 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C4B4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH2_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH2_EIRQ_EN.
*/
#define GTM_FIFO1_CH2_EIRQ_EN (GTM_PSM1_FIFO_CH2_EIRQ_EN)

/** \brief 1C4C0, FIFO1 Channel 3 Control Register */
#define GTM_PSM1_FIFO_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C4C0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_CTRL.
*/
#define GTM_FIFO1_CH3_CTRL (GTM_PSM1_FIFO_CH3_CTRL)

/** \brief 1C4C4, FIFO1 Channel 3 End Address Register */
#define GTM_PSM1_FIFO_CH3_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C4C4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_END_ADDR.
*/
#define GTM_FIFO1_CH3_END_ADDR (GTM_PSM1_FIFO_CH3_END_ADDR)

/** \brief 1C4C8, FIFO1 Channel 3 Start Address Register */
#define GTM_PSM1_FIFO_CH3_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C4C8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_START_ADDR.
*/
#define GTM_FIFO1_CH3_START_ADDR (GTM_PSM1_FIFO_CH3_START_ADDR)

/** \brief 1C4CC, FIFO1 Channel 3 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH3_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C4CCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_UPPER_WM.
*/
#define GTM_FIFO1_CH3_UPPER_WM (GTM_PSM1_FIFO_CH3_UPPER_WM)

/** \brief 1C4D0, FIFO1 Channel 3 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH3_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C4D0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_LOWER_WM.
*/
#define GTM_FIFO1_CH3_LOWER_WM (GTM_PSM1_FIFO_CH3_LOWER_WM)

/** \brief 1C4D4, FIFO1 Channel 3 Status Register */
#define GTM_PSM1_FIFO_CH3_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C4D4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_STATUS.
*/
#define GTM_FIFO1_CH3_STATUS (GTM_PSM1_FIFO_CH3_STATUS)

/** \brief 1C4D8, FIFO1 Channel 3 Fill Level Register */
#define GTM_PSM1_FIFO_CH3_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C4D8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_FILL_LEVEL.
*/
#define GTM_FIFO1_CH3_FILL_LEVEL (GTM_PSM1_FIFO_CH3_FILL_LEVEL)

/** \brief 1C4DC, FIFO1 Channel 3 Write Pointer Register */
#define GTM_PSM1_FIFO_CH3_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C4DCu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_WR_PTR.
*/
#define GTM_FIFO1_CH3_WR_PTR (GTM_PSM1_FIFO_CH3_WR_PTR)

/** \brief 1C4E0, FIFO1 Channel 3 Read Pointer Register */
#define GTM_PSM1_FIFO_CH3_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C4E0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_RD_PTR.
*/
#define GTM_FIFO1_CH3_RD_PTR (GTM_PSM1_FIFO_CH3_RD_PTR)

/** \brief 1C4E4, FIFO1 Channel 3 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C4E4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH3_IRQ_NOTIFY (GTM_PSM1_FIFO_CH3_IRQ_NOTIFY)

/** \brief 1C4E8, FIFO1 Channel 3 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C4E8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_IRQ_EN.
*/
#define GTM_FIFO1_CH3_IRQ_EN (GTM_PSM1_FIFO_CH3_IRQ_EN)

/** \brief 1C4EC, FIFO1 Channel 3 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C4ECu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH3_IRQ_FORCINT (GTM_PSM1_FIFO_CH3_IRQ_FORCINT)

/** \brief 1C4F0, FIFO1 Channel 3 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C4F0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_IRQ_MODE.
*/
#define GTM_FIFO1_CH3_IRQ_MODE (GTM_PSM1_FIFO_CH3_IRQ_MODE)

/** \brief 1C4F4, FIFO1 Channel 3 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C4F4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH3_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH3_EIRQ_EN.
*/
#define GTM_FIFO1_CH3_EIRQ_EN (GTM_PSM1_FIFO_CH3_EIRQ_EN)

/** \brief 1C500, FIFO1 Channel 4 Control Register */
#define GTM_PSM1_FIFO_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C500u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_CTRL.
*/
#define GTM_FIFO1_CH4_CTRL (GTM_PSM1_FIFO_CH4_CTRL)

