Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 1C504, FIFO1 Channel 4 End Address Register */
#define GTM_PSM1_FIFO_CH4_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C504u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_END_ADDR.
*/
#define GTM_FIFO1_CH4_END_ADDR (GTM_PSM1_FIFO_CH4_END_ADDR)

/** \brief 1C508, FIFO1 Channel 4 Start Address Register */
#define GTM_PSM1_FIFO_CH4_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C508u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_START_ADDR.
*/
#define GTM_FIFO1_CH4_START_ADDR (GTM_PSM1_FIFO_CH4_START_ADDR)

/** \brief 1C50C, FIFO1 Channel 4 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH4_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C50Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_UPPER_WM.
*/
#define GTM_FIFO1_CH4_UPPER_WM (GTM_PSM1_FIFO_CH4_UPPER_WM)

/** \brief 1C510, FIFO1 Channel 4 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH4_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C510u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_LOWER_WM.
*/
#define GTM_FIFO1_CH4_LOWER_WM (GTM_PSM1_FIFO_CH4_LOWER_WM)

/** \brief 1C514, FIFO1 Channel 4 Status Register */
#define GTM_PSM1_FIFO_CH4_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C514u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_STATUS.
*/
#define GTM_FIFO1_CH4_STATUS (GTM_PSM1_FIFO_CH4_STATUS)

/** \brief 1C518, FIFO1 Channel 4 Fill Level Register */
#define GTM_PSM1_FIFO_CH4_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C518u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_FILL_LEVEL.
*/
#define GTM_FIFO1_CH4_FILL_LEVEL (GTM_PSM1_FIFO_CH4_FILL_LEVEL)

/** \brief 1C51C, FIFO1 Channel 4 Write Pointer Register */
#define GTM_PSM1_FIFO_CH4_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C51Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_WR_PTR.
*/
#define GTM_FIFO1_CH4_WR_PTR (GTM_PSM1_FIFO_CH4_WR_PTR)

/** \brief 1C520, FIFO1 Channel 4 Read Pointer Register */
#define GTM_PSM1_FIFO_CH4_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C520u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_RD_PTR.
*/
#define GTM_FIFO1_CH4_RD_PTR (GTM_PSM1_FIFO_CH4_RD_PTR)

/** \brief 1C524, FIFO1 Channel 4 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C524u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH4_IRQ_NOTIFY (GTM_PSM1_FIFO_CH4_IRQ_NOTIFY)

/** \brief 1C528, FIFO1 Channel 4 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C528u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_IRQ_EN.
*/
#define GTM_FIFO1_CH4_IRQ_EN (GTM_PSM1_FIFO_CH4_IRQ_EN)

/** \brief 1C52C, FIFO1 Channel 4 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C52Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH4_IRQ_FORCINT (GTM_PSM1_FIFO_CH4_IRQ_FORCINT)

/** \brief 1C530, FIFO1 Channel 4 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C530u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_IRQ_MODE.
*/
#define GTM_FIFO1_CH4_IRQ_MODE (GTM_PSM1_FIFO_CH4_IRQ_MODE)

/** \brief 1C534, FIFO1 Channel 4 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C534u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH4_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH4_EIRQ_EN.
*/
#define GTM_FIFO1_CH4_EIRQ_EN (GTM_PSM1_FIFO_CH4_EIRQ_EN)

/** \brief 1C540, FIFO1 Channel 5 Control Register */
#define GTM_PSM1_FIFO_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C540u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_CTRL.
*/
#define GTM_FIFO1_CH5_CTRL (GTM_PSM1_FIFO_CH5_CTRL)

/** \brief 1C544, FIFO1 Channel 5 End Address Register */
#define GTM_PSM1_FIFO_CH5_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C544u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_END_ADDR.
*/
#define GTM_FIFO1_CH5_END_ADDR (GTM_PSM1_FIFO_CH5_END_ADDR)

/** \brief 1C548, FIFO1 Channel 5 Start Address Register */
#define GTM_PSM1_FIFO_CH5_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C548u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_START_ADDR.
*/
#define GTM_FIFO1_CH5_START_ADDR (GTM_PSM1_FIFO_CH5_START_ADDR)

/** \brief 1C54C, FIFO1 Channel 5 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH5_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C54Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_UPPER_WM.
*/
#define GTM_FIFO1_CH5_UPPER_WM (GTM_PSM1_FIFO_CH5_UPPER_WM)

