Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 1C550, FIFO1 Channel 5 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH5_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C550u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_LOWER_WM.
*/
#define GTM_FIFO1_CH5_LOWER_WM (GTM_PSM1_FIFO_CH5_LOWER_WM)

/** \brief 1C554, FIFO1 Channel 5 Status Register */
#define GTM_PSM1_FIFO_CH5_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C554u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_STATUS.
*/
#define GTM_FIFO1_CH5_STATUS (GTM_PSM1_FIFO_CH5_STATUS)

/** \brief 1C558, FIFO1 Channel 5 Fill Level Register */
#define GTM_PSM1_FIFO_CH5_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C558u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_FILL_LEVEL.
*/
#define GTM_FIFO1_CH5_FILL_LEVEL (GTM_PSM1_FIFO_CH5_FILL_LEVEL)

/** \brief 1C55C, FIFO1 Channel 5 Write Pointer Register */
#define GTM_PSM1_FIFO_CH5_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C55Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_WR_PTR.
*/
#define GTM_FIFO1_CH5_WR_PTR (GTM_PSM1_FIFO_CH5_WR_PTR)

/** \brief 1C560, FIFO1 Channel 5 Read Pointer Register */
#define GTM_PSM1_FIFO_CH5_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C560u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_RD_PTR.
*/
#define GTM_FIFO1_CH5_RD_PTR (GTM_PSM1_FIFO_CH5_RD_PTR)

/** \brief 1C564, FIFO1 Channel 5 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C564u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH5_IRQ_NOTIFY (GTM_PSM1_FIFO_CH5_IRQ_NOTIFY)

/** \brief 1C568, FIFO1 Channel 5 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C568u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_IRQ_EN.
*/
#define GTM_FIFO1_CH5_IRQ_EN (GTM_PSM1_FIFO_CH5_IRQ_EN)

/** \brief 1C56C, FIFO1 Channel 5 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C56Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH5_IRQ_FORCINT (GTM_PSM1_FIFO_CH5_IRQ_FORCINT)

/** \brief 1C570, FIFO1 Channel 5 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C570u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_IRQ_MODE.
*/
#define GTM_FIFO1_CH5_IRQ_MODE (GTM_PSM1_FIFO_CH5_IRQ_MODE)

/** \brief 1C574, FIFO1 Channel 5 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C574u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH5_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH5_EIRQ_EN.
*/
#define GTM_FIFO1_CH5_EIRQ_EN (GTM_PSM1_FIFO_CH5_EIRQ_EN)

/** \brief 1C580, FIFO1 Channel 6 Control Register */
#define GTM_PSM1_FIFO_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C580u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_CTRL.
*/
#define GTM_FIFO1_CH6_CTRL (GTM_PSM1_FIFO_CH6_CTRL)

/** \brief 1C584, FIFO1 Channel 6 End Address Register */
#define GTM_PSM1_FIFO_CH6_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C584u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_END_ADDR.
*/
#define GTM_FIFO1_CH6_END_ADDR (GTM_PSM1_FIFO_CH6_END_ADDR)

/** \brief 1C588, FIFO1 Channel 6 Start Address Register */
#define GTM_PSM1_FIFO_CH6_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF011C588u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_START_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_START_ADDR.
*/
#define GTM_FIFO1_CH6_START_ADDR (GTM_PSM1_FIFO_CH6_START_ADDR)

/** \brief 1C58C, FIFO1 Channel 6 Upper Watermark Register */
#define GTM_PSM1_FIFO_CH6_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF011C58Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_UPPER_WM.
*/
#define GTM_FIFO1_CH6_UPPER_WM (GTM_PSM1_FIFO_CH6_UPPER_WM)

/** \brief 1C590, FIFO1 Channel 6 Lower Watermark Register */
#define GTM_PSM1_FIFO_CH6_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF011C590u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_LOWER_WM.
*/
#define GTM_FIFO1_CH6_LOWER_WM (GTM_PSM1_FIFO_CH6_LOWER_WM)

/** \brief 1C594, FIFO1 Channel 6 Status Register */
#define GTM_PSM1_FIFO_CH6_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF011C594u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_STATUS.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_STATUS.
*/
#define GTM_FIFO1_CH6_STATUS (GTM_PSM1_FIFO_CH6_STATUS)

/** \brief 1C598, FIFO1 Channel 6 Fill Level Register */
#define GTM_PSM1_FIFO_CH6_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF011C598u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_FILL_LEVEL.
*/
#define GTM_FIFO1_CH6_FILL_LEVEL (GTM_PSM1_FIFO_CH6_FILL_LEVEL)

/** \brief 1C59C, FIFO1 Channel 6 Write Pointer Register */
#define GTM_PSM1_FIFO_CH6_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF011C59Cu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_WR_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_WR_PTR.
*/
#define GTM_FIFO1_CH6_WR_PTR (GTM_PSM1_FIFO_CH6_WR_PTR)

/** \brief 1C5A0, FIFO1 Channel 6 Read Pointer Register */
#define GTM_PSM1_FIFO_CH6_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF011C5A0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_RD_PTR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_RD_PTR.
*/
#define GTM_FIFO1_CH6_RD_PTR (GTM_PSM1_FIFO_CH6_RD_PTR)

/** \brief 1C5A4, FIFO1 Channel 6 Interrupt Notification Register */
#define GTM_PSM1_FIFO_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF011C5A4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_IRQ_NOTIFY.
*/
#define GTM_FIFO1_CH6_IRQ_NOTIFY (GTM_PSM1_FIFO_CH6_IRQ_NOTIFY)

/** \brief 1C5A8, FIFO1 Channel 6 Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF011C5A8u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_IRQ_EN.
*/
#define GTM_FIFO1_CH6_IRQ_EN (GTM_PSM1_FIFO_CH6_IRQ_EN)

/** \brief 1C5AC, FIFO1 Channel 6 Force Interrupt Register */
#define GTM_PSM1_FIFO_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF011C5ACu)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_IRQ_FORCINT.
*/
#define GTM_FIFO1_CH6_IRQ_FORCINT (GTM_PSM1_FIFO_CH6_IRQ_FORCINT)

/** \brief 1C5B0, FIFO1 Channel 6 Interrupt Mode Control Register */
#define GTM_PSM1_FIFO_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF011C5B0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_IRQ_MODE.
*/
#define GTM_FIFO1_CH6_IRQ_MODE (GTM_PSM1_FIFO_CH6_IRQ_MODE)

/** \brief 1C5B4, FIFO1 Channel 6 Error Interrupt Enable Register */
#define GTM_PSM1_FIFO_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF011C5B4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH6_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH6_EIRQ_EN.
*/
#define GTM_FIFO1_CH6_EIRQ_EN (GTM_PSM1_FIFO_CH6_EIRQ_EN)

/** \brief 1C5C0, FIFO1 Channel 7 Control Register */
#define GTM_PSM1_FIFO_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF011C5C0u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_CTRL.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_CTRL.
*/
#define GTM_FIFO1_CH7_CTRL (GTM_PSM1_FIFO_CH7_CTRL)

/** \brief 1C5C4, FIFO1 Channel 7 End Address Register */
#define GTM_PSM1_FIFO_CH7_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF011C5C4u)
/** Alias (User Manual Name) for GTM_PSM1_FIFO_CH7_END_ADDR.
* To use register names with standard convension, please use GTM_PSM1_FIFO_CH7_END_ADDR.
*/
#define GTM_FIFO1_CH7_END_ADDR (GTM_PSM1_FIFO_CH7_END_ADDR)

