Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 20010, F2A2 Stream 4 Read Address Register */
#define GTM_PSM2_F2A_RD_CH4_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120010u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH4_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH4_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH4_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH4_ARU_RD_FIFO)

/** \brief 20014, F2A2 Stream 5 Read Address Register */
#define GTM_PSM2_F2A_RD_CH5_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120014u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH5_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH5_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH5_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH5_ARU_RD_FIFO)

/** \brief 20018, F2A2 Stream 6 Read Address Register */
#define GTM_PSM2_F2A_RD_CH6_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF0120018u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH6_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH6_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH6_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH6_ARU_RD_FIFO)

/** \brief 2001C, F2A2 Stream 7 Read Address Register */
#define GTM_PSM2_F2A_RD_CH7_ARU_RD_FIFO /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO*)0xF012001Cu)
/** Alias (User Manual Name) for GTM_PSM2_F2A_RD_CH7_ARU_RD_FIFO.
* To use register names with standard convension, please use GTM_PSM2_F2A_RD_CH7_ARU_RD_FIFO.
*/
#define GTM_F2A2_CH7_ARU_RD_FIFO (GTM_PSM2_F2A_RD_CH7_ARU_RD_FIFO)

/** \brief 20020, F2A2 Stream 0 Configuration Register */
#define GTM_PSM2_F2A_STR_CH0_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120020u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH0_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH0_STR_CFG.
*/
#define GTM_F2A2_CH0_STR_CFG (GTM_PSM2_F2A_STR_CH0_STR_CFG)

/** \brief 20024, F2A2 Stream 1 Configuration Register */
#define GTM_PSM2_F2A_STR_CH1_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120024u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH1_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH1_STR_CFG.
*/
#define GTM_F2A2_CH1_STR_CFG (GTM_PSM2_F2A_STR_CH1_STR_CFG)

/** \brief 20028, F2A2 Stream 2 Configuration Register */
#define GTM_PSM2_F2A_STR_CH2_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120028u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH2_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH2_STR_CFG.
*/
#define GTM_F2A2_CH2_STR_CFG (GTM_PSM2_F2A_STR_CH2_STR_CFG)

/** \brief 2002C, F2A2 Stream 3 Configuration Register */
#define GTM_PSM2_F2A_STR_CH3_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF012002Cu)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH3_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH3_STR_CFG.
*/
#define GTM_F2A2_CH3_STR_CFG (GTM_PSM2_F2A_STR_CH3_STR_CFG)

/** \brief 20030, F2A2 Stream 4 Configuration Register */
#define GTM_PSM2_F2A_STR_CH4_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120030u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH4_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH4_STR_CFG.
*/
#define GTM_F2A2_CH4_STR_CFG (GTM_PSM2_F2A_STR_CH4_STR_CFG)

/** \brief 20034, F2A2 Stream 5 Configuration Register */
#define GTM_PSM2_F2A_STR_CH5_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120034u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH5_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH5_STR_CFG.
*/
#define GTM_F2A2_CH5_STR_CFG (GTM_PSM2_F2A_STR_CH5_STR_CFG)

/** \brief 20038, F2A2 Stream 6 Configuration Register */
#define GTM_PSM2_F2A_STR_CH6_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF0120038u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH6_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH6_STR_CFG.
*/
#define GTM_F2A2_CH6_STR_CFG (GTM_PSM2_F2A_STR_CH6_STR_CFG)

/** \brief 2003C, F2A2 Stream 7 Configuration Register */
#define GTM_PSM2_F2A_STR_CH7_STR_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_STR_CH_STR_CFG*)0xF012003Cu)
/** Alias (User Manual Name) for GTM_PSM2_F2A_STR_CH7_STR_CFG.
* To use register names with standard convension, please use GTM_PSM2_F2A_STR_CH7_STR_CFG.
*/
#define GTM_F2A2_CH7_STR_CFG (GTM_PSM2_F2A_STR_CH7_STR_CFG)

/** \brief 20040, F2A2 Stream Activation Register */
#define GTM_PSM2_F2A_ENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_ENABLE*)0xF0120040u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_ENABLE.
* To use register names with standard convension, please use GTM_PSM2_F2A_ENABLE.
*/
#define GTM_F2A2_ENABLE (GTM_PSM2_F2A_ENABLE)

/** \brief 20044, F2A2 Stream Control Register */
#define GTM_PSM2_F2A_F2A_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_F2A_F2A_CTRL*)0xF0120044u)
/** Alias (User Manual Name) for GTM_PSM2_F2A_F2A_CTRL.
* To use register names with standard convension, please use GTM_PSM2_F2A_F2A_CTRL.
*/
#define GTM_F2A2_CTRL (GTM_PSM2_F2A_F2A_CTRL)

/** \brief 20080, AFD 2 FIFO 0 Buffer Access Register */
#define GTM_PSM2_AFD_CH0_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF0120080u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH0_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH0_BUF_ACC.
*/
#define GTM_AFD2_CH0_BUF_ACC (GTM_PSM2_AFD_CH0_BUF_ACC)

/** \brief 20090, AFD 2 FIFO 1 Buffer Access Register */
#define GTM_PSM2_AFD_CH1_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF0120090u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH1_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH1_BUF_ACC.
*/
#define GTM_AFD2_CH1_BUF_ACC (GTM_PSM2_AFD_CH1_BUF_ACC)

/** \brief 200A0, AFD 2 FIFO 2 Buffer Access Register */
#define GTM_PSM2_AFD_CH2_BUF_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_AFD_CH_BUF_ACC*)0xF01200A0u)
/** Alias (User Manual Name) for GTM_PSM2_AFD_CH2_BUF_ACC.
* To use register names with standard convension, please use GTM_PSM2_AFD_CH2_BUF_ACC.
*/
#define GTM_AFD2_CH2_BUF_ACC (GTM_PSM2_AFD_CH2_BUF_ACC)

