Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 20484, FIFO2 Channel 2 End Address Register */
#define GTM_PSM2_FIFO_CH2_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120484u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_END_ADDR.
*/
#define GTM_FIFO2_CH2_END_ADDR (GTM_PSM2_FIFO_CH2_END_ADDR)

/** \brief 20488, FIFO2 Channel 2 Start Address Register */
#define GTM_PSM2_FIFO_CH2_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120488u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_START_ADDR.
*/
#define GTM_FIFO2_CH2_START_ADDR (GTM_PSM2_FIFO_CH2_START_ADDR)

/** \brief 2048C, FIFO2 Channel 2 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH2_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012048Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_UPPER_WM.
*/
#define GTM_FIFO2_CH2_UPPER_WM (GTM_PSM2_FIFO_CH2_UPPER_WM)

/** \brief 20490, FIFO2 Channel 2 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH2_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120490u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_LOWER_WM.
*/
#define GTM_FIFO2_CH2_LOWER_WM (GTM_PSM2_FIFO_CH2_LOWER_WM)

/** \brief 20494, FIFO2 Channel 2 Status Register */
#define GTM_PSM2_FIFO_CH2_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120494u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_STATUS.
*/
#define GTM_FIFO2_CH2_STATUS (GTM_PSM2_FIFO_CH2_STATUS)

/** \brief 20498, FIFO2 Channel 2 Fill Level Register */
#define GTM_PSM2_FIFO_CH2_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120498u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_FILL_LEVEL.
*/
#define GTM_FIFO2_CH2_FILL_LEVEL (GTM_PSM2_FIFO_CH2_FILL_LEVEL)

/** \brief 2049C, FIFO2 Channel 2 Write Pointer Register */
#define GTM_PSM2_FIFO_CH2_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012049Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_WR_PTR.
*/
#define GTM_FIFO2_CH2_WR_PTR (GTM_PSM2_FIFO_CH2_WR_PTR)

/** \brief 204A0, FIFO2 Channel 2 Read Pointer Register */
#define GTM_PSM2_FIFO_CH2_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF01204A0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_RD_PTR.
*/
#define GTM_FIFO2_CH2_RD_PTR (GTM_PSM2_FIFO_CH2_RD_PTR)

/** \brief 204A4, FIFO2 Channel 2 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF01204A4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH2_IRQ_NOTIFY (GTM_PSM2_FIFO_CH2_IRQ_NOTIFY)

/** \brief 204A8, FIFO2 Channel 2 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF01204A8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_IRQ_EN.
*/
#define GTM_FIFO2_CH2_IRQ_EN (GTM_PSM2_FIFO_CH2_IRQ_EN)

/** \brief 204AC, FIFO2 Channel 2 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF01204ACu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH2_IRQ_FORCINT (GTM_PSM2_FIFO_CH2_IRQ_FORCINT)

/** \brief 204B0, FIFO2 Channel 2 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF01204B0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_IRQ_MODE.
*/
#define GTM_FIFO2_CH2_IRQ_MODE (GTM_PSM2_FIFO_CH2_IRQ_MODE)

/** \brief 204B4, FIFO2 Channel 2 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF01204B4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH2_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH2_EIRQ_EN.
*/
#define GTM_FIFO2_CH2_EIRQ_EN (GTM_PSM2_FIFO_CH2_EIRQ_EN)

/** \brief 204C0, FIFO2 Channel 3 Control Register */
#define GTM_PSM2_FIFO_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF01204C0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_CTRL.
*/
#define GTM_FIFO2_CH3_CTRL (GTM_PSM2_FIFO_CH3_CTRL)

/** \brief 204C4, FIFO2 Channel 3 End Address Register */
#define GTM_PSM2_FIFO_CH3_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF01204C4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_END_ADDR.
*/
#define GTM_FIFO2_CH3_END_ADDR (GTM_PSM2_FIFO_CH3_END_ADDR)

/** \brief 204C8, FIFO2 Channel 3 Start Address Register */
#define GTM_PSM2_FIFO_CH3_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF01204C8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_START_ADDR.
*/
#define GTM_FIFO2_CH3_START_ADDR (GTM_PSM2_FIFO_CH3_START_ADDR)

/** \brief 204CC, FIFO2 Channel 3 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH3_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF01204CCu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_UPPER_WM.
*/
#define GTM_FIFO2_CH3_UPPER_WM (GTM_PSM2_FIFO_CH3_UPPER_WM)

/** \brief 204D0, FIFO2 Channel 3 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH3_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF01204D0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_LOWER_WM.
*/
#define GTM_FIFO2_CH3_LOWER_WM (GTM_PSM2_FIFO_CH3_LOWER_WM)

/** \brief 204D4, FIFO2 Channel 3 Status Register */
#define GTM_PSM2_FIFO_CH3_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF01204D4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_STATUS.
*/
#define GTM_FIFO2_CH3_STATUS (GTM_PSM2_FIFO_CH3_STATUS)

/** \brief 204D8, FIFO2 Channel 3 Fill Level Register */
#define GTM_PSM2_FIFO_CH3_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF01204D8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_FILL_LEVEL.
*/
#define GTM_FIFO2_CH3_FILL_LEVEL (GTM_PSM2_FIFO_CH3_FILL_LEVEL)

/** \brief 204DC, FIFO2 Channel 3 Write Pointer Register */
#define GTM_PSM2_FIFO_CH3_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF01204DCu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_WR_PTR.
*/
#define GTM_FIFO2_CH3_WR_PTR (GTM_PSM2_FIFO_CH3_WR_PTR)

