Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 204E0, FIFO2 Channel 3 Read Pointer Register */
#define GTM_PSM2_FIFO_CH3_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF01204E0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_RD_PTR.
*/
#define GTM_FIFO2_CH3_RD_PTR (GTM_PSM2_FIFO_CH3_RD_PTR)

/** \brief 204E4, FIFO2 Channel 3 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF01204E4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH3_IRQ_NOTIFY (GTM_PSM2_FIFO_CH3_IRQ_NOTIFY)

/** \brief 204E8, FIFO2 Channel 3 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF01204E8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_IRQ_EN.
*/
#define GTM_FIFO2_CH3_IRQ_EN (GTM_PSM2_FIFO_CH3_IRQ_EN)

/** \brief 204EC, FIFO2 Channel 3 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF01204ECu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH3_IRQ_FORCINT (GTM_PSM2_FIFO_CH3_IRQ_FORCINT)

/** \brief 204F0, FIFO2 Channel 3 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF01204F0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_IRQ_MODE.
*/
#define GTM_FIFO2_CH3_IRQ_MODE (GTM_PSM2_FIFO_CH3_IRQ_MODE)

/** \brief 204F4, FIFO2 Channel 3 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF01204F4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH3_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH3_EIRQ_EN.
*/
#define GTM_FIFO2_CH3_EIRQ_EN (GTM_PSM2_FIFO_CH3_EIRQ_EN)

/** \brief 20500, FIFO2 Channel 4 Control Register */
#define GTM_PSM2_FIFO_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF0120500u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_CTRL.
*/
#define GTM_FIFO2_CH4_CTRL (GTM_PSM2_FIFO_CH4_CTRL)

/** \brief 20504, FIFO2 Channel 4 End Address Register */
#define GTM_PSM2_FIFO_CH4_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF0120504u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_END_ADDR.
*/
#define GTM_FIFO2_CH4_END_ADDR (GTM_PSM2_FIFO_CH4_END_ADDR)

/** \brief 20508, FIFO2 Channel 4 Start Address Register */
#define GTM_PSM2_FIFO_CH4_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF0120508u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_START_ADDR.
*/
#define GTM_FIFO2_CH4_START_ADDR (GTM_PSM2_FIFO_CH4_START_ADDR)

/** \brief 2050C, FIFO2 Channel 4 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH4_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF012050Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_UPPER_WM.
*/
#define GTM_FIFO2_CH4_UPPER_WM (GTM_PSM2_FIFO_CH4_UPPER_WM)

/** \brief 20510, FIFO2 Channel 4 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH4_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF0120510u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_LOWER_WM.
*/
#define GTM_FIFO2_CH4_LOWER_WM (GTM_PSM2_FIFO_CH4_LOWER_WM)

/** \brief 20514, FIFO2 Channel 4 Status Register */
#define GTM_PSM2_FIFO_CH4_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF0120514u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_STATUS.
*/
#define GTM_FIFO2_CH4_STATUS (GTM_PSM2_FIFO_CH4_STATUS)

/** \brief 20518, FIFO2 Channel 4 Fill Level Register */
#define GTM_PSM2_FIFO_CH4_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF0120518u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_FILL_LEVEL.
*/
#define GTM_FIFO2_CH4_FILL_LEVEL (GTM_PSM2_FIFO_CH4_FILL_LEVEL)

/** \brief 2051C, FIFO2 Channel 4 Write Pointer Register */
#define GTM_PSM2_FIFO_CH4_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF012051Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_WR_PTR.
*/
#define GTM_FIFO2_CH4_WR_PTR (GTM_PSM2_FIFO_CH4_WR_PTR)

/** \brief 20520, FIFO2 Channel 4 Read Pointer Register */
#define GTM_PSM2_FIFO_CH4_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF0120520u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_RD_PTR.
*/
#define GTM_FIFO2_CH4_RD_PTR (GTM_PSM2_FIFO_CH4_RD_PTR)

/** \brief 20524, FIFO2 Channel 4 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF0120524u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH4_IRQ_NOTIFY (GTM_PSM2_FIFO_CH4_IRQ_NOTIFY)

/** \brief 20528, FIFO2 Channel 4 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF0120528u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_IRQ_EN.
*/
#define GTM_FIFO2_CH4_IRQ_EN (GTM_PSM2_FIFO_CH4_IRQ_EN)

/** \brief 2052C, FIFO2 Channel 4 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF012052Cu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH4_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH4_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH4_IRQ_FORCINT (GTM_PSM2_FIFO_CH4_IRQ_FORCINT)

