Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief 205A4, FIFO2 Channel 6 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF01205A4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH6_IRQ_NOTIFY (GTM_PSM2_FIFO_CH6_IRQ_NOTIFY)

/** \brief 205A8, FIFO2 Channel 6 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF01205A8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_IRQ_EN.
*/
#define GTM_FIFO2_CH6_IRQ_EN (GTM_PSM2_FIFO_CH6_IRQ_EN)

/** \brief 205AC, FIFO2 Channel 6 Force Interrupt Register */
#define GTM_PSM2_FIFO_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_FORCINT*)0xF01205ACu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_IRQ_FORCINT.
*/
#define GTM_FIFO2_CH6_IRQ_FORCINT (GTM_PSM2_FIFO_CH6_IRQ_FORCINT)

/** \brief 205B0, FIFO2 Channel 6 Interrupt Mode Control Register */
#define GTM_PSM2_FIFO_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_MODE*)0xF01205B0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_IRQ_MODE.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_IRQ_MODE.
*/
#define GTM_FIFO2_CH6_IRQ_MODE (GTM_PSM2_FIFO_CH6_IRQ_MODE)

/** \brief 205B4, FIFO2 Channel 6 Error Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_EIRQ_EN*)0xF01205B4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH6_EIRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH6_EIRQ_EN.
*/
#define GTM_FIFO2_CH6_EIRQ_EN (GTM_PSM2_FIFO_CH6_EIRQ_EN)

/** \brief 205C0, FIFO2 Channel 7 Control Register */
#define GTM_PSM2_FIFO_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_CTRL*)0xF01205C0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_CTRL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_CTRL.
*/
#define GTM_FIFO2_CH7_CTRL (GTM_PSM2_FIFO_CH7_CTRL)

/** \brief 205C4, FIFO2 Channel 7 End Address Register */
#define GTM_PSM2_FIFO_CH7_END_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_END_ADDR*)0xF01205C4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_END_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_END_ADDR.
*/
#define GTM_FIFO2_CH7_END_ADDR (GTM_PSM2_FIFO_CH7_END_ADDR)

/** \brief 205C8, FIFO2 Channel 7 Start Address Register */
#define GTM_PSM2_FIFO_CH7_START_ADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_START_ADDR*)0xF01205C8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_START_ADDR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_START_ADDR.
*/
#define GTM_FIFO2_CH7_START_ADDR (GTM_PSM2_FIFO_CH7_START_ADDR)

/** \brief 205CC, FIFO2 Channel 7 Upper Watermark Register */
#define GTM_PSM2_FIFO_CH7_UPPER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_UPPER_WM*)0xF01205CCu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_UPPER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_UPPER_WM.
*/
#define GTM_FIFO2_CH7_UPPER_WM (GTM_PSM2_FIFO_CH7_UPPER_WM)

/** \brief 205D0, FIFO2 Channel 7 Lower Watermark Register */
#define GTM_PSM2_FIFO_CH7_LOWER_WM /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_LOWER_WM*)0xF01205D0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_LOWER_WM.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_LOWER_WM.
*/
#define GTM_FIFO2_CH7_LOWER_WM (GTM_PSM2_FIFO_CH7_LOWER_WM)

/** \brief 205D4, FIFO2 Channel 7 Status Register */
#define GTM_PSM2_FIFO_CH7_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_STATUS*)0xF01205D4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_STATUS.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_STATUS.
*/
#define GTM_FIFO2_CH7_STATUS (GTM_PSM2_FIFO_CH7_STATUS)

/** \brief 205D8, FIFO2 Channel 7 Fill Level Register */
#define GTM_PSM2_FIFO_CH7_FILL_LEVEL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL*)0xF01205D8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_FILL_LEVEL.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_FILL_LEVEL.
*/
#define GTM_FIFO2_CH7_FILL_LEVEL (GTM_PSM2_FIFO_CH7_FILL_LEVEL)

/** \brief 205DC, FIFO2 Channel 7 Write Pointer Register */
#define GTM_PSM2_FIFO_CH7_WR_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_WR_PTR*)0xF01205DCu)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_WR_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_WR_PTR.
*/
#define GTM_FIFO2_CH7_WR_PTR (GTM_PSM2_FIFO_CH7_WR_PTR)

/** \brief 205E0, FIFO2 Channel 7 Read Pointer Register */
#define GTM_PSM2_FIFO_CH7_RD_PTR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_RD_PTR*)0xF01205E0u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_RD_PTR.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_RD_PTR.
*/
#define GTM_FIFO2_CH7_RD_PTR (GTM_PSM2_FIFO_CH7_RD_PTR)

/** \brief 205E4, FIFO2 Channel 7 Interrupt Notification Register */
#define GTM_PSM2_FIFO_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_NOTIFY*)0xF01205E4u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_IRQ_NOTIFY.
*/
#define GTM_FIFO2_CH7_IRQ_NOTIFY (GTM_PSM2_FIFO_CH7_IRQ_NOTIFY)

/** \brief 205E8, FIFO2 Channel 7 Interrupt Enable Register */
#define GTM_PSM2_FIFO_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_PSM_FIFO_CH_IRQ_EN*)0xF01205E8u)
/** Alias (User Manual Name) for GTM_PSM2_FIFO_CH7_IRQ_EN.
* To use register names with standard convension, please use GTM_PSM2_FIFO_CH7_IRQ_EN.
*/
#define GTM_FIFO2_CH7_IRQ_EN (GTM_PSM2_FIFO_CH7_IRQ_EN)

