Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief E31F0, CCM8 CMU Clock Configuration Register */
#define GTM_CCM8_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E31F0u)

/** \brief E31F4, CCM8 CMU Fixed Clock Configuration Register */
#define GTM_CCM8_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E31F4u)

/** \brief E31F8, CCM8 Configuration Register */
#define GTM_CCM8_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E31F8u)

/** \brief E31FC, CCM8 Protection Register */
#define GTM_CCM8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E31FCu)

/** \brief E3200, CCM9 Address Range Protector 0 Control Register */
#define GTM_CCM9_ARP0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3200u)

/** \brief E3204, CCM9 Address Range Protector 0 Protection Register */
#define GTM_CCM9_ARP0_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3204u)

/** \brief E3208, CCM9 Address Range Protector 1 Control Register */
#define GTM_CCM9_ARP1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3208u)

/** \brief E320C, CCM9 Address Range Protector 1 Protection Register */
#define GTM_CCM9_ARP1_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E320Cu)

/** \brief E3210, CCM9 Address Range Protector 2 Control Register */
#define GTM_CCM9_ARP2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3210u)

/** \brief E3214, CCM9 Address Range Protector 2 Protection Register */
#define GTM_CCM9_ARP2_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3214u)

/** \brief E3218, CCM9 Address Range Protector 3 Control Register */
#define GTM_CCM9_ARP3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3218u)

/** \brief E321C, CCM9 Address Range Protector 3 Protection Register */
#define GTM_CCM9_ARP3_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E321Cu)

/** \brief E3220, CCM9 Address Range Protector 4 Control Register */
#define GTM_CCM9_ARP4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3220u)

/** \brief E3224, CCM9 Address Range Protector 4 Protection Register */
#define GTM_CCM9_ARP4_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3224u)

/** \brief E3228, CCM9 Address Range Protector 5 Control Register */
#define GTM_CCM9_ARP5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3228u)

/** \brief E322C, CCM9 Address Range Protector 5 Protection Register */
#define GTM_CCM9_ARP5_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E322Cu)

/** \brief E3230, CCM9 Address Range Protector 6 Control Register */
#define GTM_CCM9_ARP6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3230u)

/** \brief E3234, CCM9 Address Range Protector 6 Protection Register */
#define GTM_CCM9_ARP6_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3234u)

/** \brief E3238, CCM9 Address Range Protector 7 Control Register */
#define GTM_CCM9_ARP7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3238u)

/** \brief E323C, CCM9 Address Range Protector 7 Protection Register */
#define GTM_CCM9_ARP7_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E323Cu)

/** \brief E3240, CCM9 Address Range Protector 8 Control Register */
#define GTM_CCM9_ARP8_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3240u)

/** \brief E3244, CCM9 Address Range Protector 8 Protection Register */
#define GTM_CCM9_ARP8_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E3244u)

/** \brief E3248, CCM9 Address Range Protector 9 Control Register */
#define GTM_CCM9_ARP9_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_CTRL*)0xF01E3248u)

/** \brief E324C, CCM9 Address Range Protector 9 Protection Register */
#define GTM_CCM9_ARP9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ARP_PROT*)0xF01E324Cu)

/** \brief E33D8, CCM9 MCS Bus Master Status Register */
#define GTM_CCM9_AEIM_STA /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA*)0xF01E33D8u)

/** \brief E33DC, CCM9 Hardware Configuration Register */
#define GTM_CCM9_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E33DCu)

/** \brief E33EC, CCM9 ATOM Output Level Register */
#define GTM_CCM9_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E33ECu)

/** \brief E33F0, CCM9 CMU Clock Configuration Register */
#define GTM_CCM9_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E33F0u)

/** \brief E33F4, CCM9 CMU Fixed Clock Configuration Register */
#define GTM_CCM9_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E33F4u)

/** \brief E33F8, CCM9 Configuration Register */
#define GTM_CCM9_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E33F8u)

/** \brief E33FC, CCM9 Protection Register */
#define GTM_CCM9_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E33FCu)

/** \brief E35DC, CCM10 Hardware Configuration Register */
#define GTM_CCM10_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E35DCu)

/** \brief E35EC, CCM10 ATOM Output Level Register */
#define GTM_CCM10_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E35ECu)

/** \brief E35F0, CCM10 CMU Clock Configuration Register */
#define GTM_CCM10_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E35F0u)

/** \brief E35F4, CCM10 CMU Fixed Clock Configuration Register */
#define GTM_CCM10_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E35F4u)

/** \brief E35F8, CCM10 Configuration Register */
#define GTM_CCM10_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E35F8u)

/** \brief E35FC, CCM10 Protection Register */
#define GTM_CCM10_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E35FCu)

/** \brief E37DC, CCM11 Hardware Configuration Register */
#define GTM_CCM11_HW_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_HW_CONF*)0xF01E37DCu)

/** \brief E37EC, CCM11 ATOM Output Level Register */
#define GTM_CCM11_ATOM_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT*)0xF01E37ECu)

/** \brief E37F0, CCM11 CMU Clock Configuration Register */
#define GTM_CCM11_CMU_CLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG*)0xF01E37F0u)

/** \brief E37F4, CCM11 CMU Fixed Clock Configuration Register */
#define GTM_CCM11_CMU_FXCLK_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG*)0xF01E37F4u)

/** \brief E37F8, CCM11 Configuration Register */
#define GTM_CCM11_CFG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_CFG*)0xF01E37F8u)

/** \brief E37FC, CCM11 Protection Register */
#define GTM_CCM11_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CCM_PROT*)0xF01E37FCu)

/** \brief E4000, CDTM0 DTM0 Global Configuration and Control Register */
#define GTM_CDTM0_DTM0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E4000u)

/** \brief E4004, CDTM0 DTM0 Channel Control Register 1 */
#define GTM_CDTM0_DTM0_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E4004u)

/** \brief E4008, CDTM0 DTM0 Channel Control Register 2 */
#define GTM_CDTM0_DTM0_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E4008u)

/** \brief E400C, CDTM0 DTM0 Channel Control Register 2 Shadow */
#define GTM_CDTM0_DTM0_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E400Cu)

