Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief E5100, CDTM4 DTM4 Global Configuration and Control Register */
#define GTM_CDTM4_DTM4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E5100u)

/** \brief E5104, CDTM4 DTM4 Channel Control Register 1 */
#define GTM_CDTM4_DTM4_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E5104u)

/** \brief E5108, CDTM4 DTM4 Channel Control Register 2 */
#define GTM_CDTM4_DTM4_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E5108u)

/** \brief E510C, CDTM4 DTM4 Channel Control Register 2 Shadow */
#define GTM_CDTM4_DTM4_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E510Cu)

/** \brief E5110, CDTM4 DTM4 Phase Shift Unit Configuration and Control Register */
#define GTM_CDTM4_DTM4_PS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL*)0xF01E5110u)

/** \brief E5114, CDTM4 DTM4 Channel 0 Dead Time Reload Values */
#define GTM_CDTM4_DTM4_CH0_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5114u)

/** \brief E5118, CDTM4 DTM4 Channel 1 Dead Time Reload Values */
#define GTM_CDTM4_DTM4_CH1_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5118u)

/** \brief E511C, CDTM4 DTM4 Channel 2 Dead Time Reload Values */
#define GTM_CDTM4_DTM4_CH2_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E511Cu)

/** \brief E5120, CDTM4 DTM4 Channel 3 Dead Time Reload Values */
#define GTM_CDTM4_DTM4_CH3_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5120u)

/** \brief E5124, CDTM4 DTM4 Channel Shadow Register */
#define GTM_CDTM4_DTM4_CH_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR*)0xF01E5124u)

/** \brief E5128, CDTM4 DTM4 Channel Control Register 3 */
#define GTM_CDTM4_DTM4_CH_CTRL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3*)0xF01E5128u)

/** \brief E5140, CDTM4 DTM5 Global Configuration and Control Register */
#define GTM_CDTM4_DTM5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E5140u)

/** \brief E5144, CDTM4 DTM5 Channel Control Register 1 */
#define GTM_CDTM4_DTM5_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E5144u)

/** \brief E5148, CDTM4 DTM5 Channel Control Register 2 */
#define GTM_CDTM4_DTM5_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E5148u)

/** \brief E514C, CDTM4 DTM5 Channel Control Register 2 Shadow */
#define GTM_CDTM4_DTM5_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E514Cu)

/** \brief E5150, CDTM4 DTM5 Phase Shift Unit Configuration and Control Register */
#define GTM_CDTM4_DTM5_PS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL*)0xF01E5150u)

/** \brief E5154, CDTM4 DTM5 Channel 0 Dead Time Reload Values */
#define GTM_CDTM4_DTM5_CH0_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5154u)

/** \brief E5158, CDTM4 DTM5 Channel 1 Dead Time Reload Values */
#define GTM_CDTM4_DTM5_CH1_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5158u)

/** \brief E515C, CDTM4 DTM5 Channel 2 Dead Time Reload Values */
#define GTM_CDTM4_DTM5_CH2_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E515Cu)

/** \brief E5160, CDTM4 DTM5 Channel 3 Dead Time Reload Values */
#define GTM_CDTM4_DTM5_CH3_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5160u)

/** \brief E5164, CDTM4 DTM5 Channel Shadow Register */
#define GTM_CDTM4_DTM5_CH_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR*)0xF01E5164u)

/** \brief E5168, CDTM4 DTM5 Channel Control Register 3 */
#define GTM_CDTM4_DTM5_CH_CTRL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3*)0xF01E5168u)

/** \brief E5500, CDTM5 DTM4 Global Configuration and Control Register */
#define GTM_CDTM5_DTM4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E5500u)

/** \brief E5504, CDTM5 DTM4 Channel Control Register 1 */
#define GTM_CDTM5_DTM4_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E5504u)

/** \brief E5508, CDTM5 DTM4 Channel Control Register 2 */
#define GTM_CDTM5_DTM4_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E5508u)

/** \brief E550C, CDTM5 DTM4 Channel Control Register 2 Shadow */
#define GTM_CDTM5_DTM4_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E550Cu)

/** \brief E5510, CDTM5 DTM4 Phase Shift Unit Configuration and Control Register */
#define GTM_CDTM5_DTM4_PS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL*)0xF01E5510u)

/** \brief E5514, CDTM5 DTM4 Channel 0 Dead Time Reload Values */
#define GTM_CDTM5_DTM4_CH0_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5514u)

/** \brief E5518, CDTM5 DTM4 Channel 1 Dead Time Reload Values */
#define GTM_CDTM5_DTM4_CH1_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5518u)

/** \brief E551C, CDTM5 DTM4 Channel 2 Dead Time Reload Values */
#define GTM_CDTM5_DTM4_CH2_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E551Cu)

/** \brief E5520, CDTM5 DTM4 Channel 3 Dead Time Reload Values */
#define GTM_CDTM5_DTM4_CH3_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5520u)

/** \brief E5524, CDTM5 DTM4 Channel Shadow Register */
#define GTM_CDTM5_DTM4_CH_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR*)0xF01E5524u)

/** \brief E5528, CDTM5 DTM4 Channel Control Register 3 */
#define GTM_CDTM5_DTM4_CH_CTRL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3*)0xF01E5528u)

/** \brief E5540, CDTM5 DTM5 Global Configuration and Control Register */
#define GTM_CDTM5_DTM5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL*)0xF01E5540u)

/** \brief E5544, CDTM5 DTM5 Channel Control Register 1 */
#define GTM_CDTM5_DTM5_CH_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1*)0xF01E5544u)

/** \brief E5548, CDTM5 DTM5 Channel Control Register 2 */
#define GTM_CDTM5_DTM5_CH_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2*)0xF01E5548u)

/** \brief E554C, CDTM5 DTM5 Channel Control Register 2 Shadow */
#define GTM_CDTM5_DTM5_CH_CTRL2_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR*)0xF01E554Cu)

/** \brief E5550, CDTM5 DTM5 Phase Shift Unit Configuration and Control Register */
#define GTM_CDTM5_DTM5_PS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL*)0xF01E5550u)

/** \brief E5554, CDTM5 DTM5 Channel 0 Dead Time Reload Values */
#define GTM_CDTM5_DTM5_CH0_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5554u)

/** \brief E5558, CDTM5 DTM5 Channel 1 Dead Time Reload Values */
#define GTM_CDTM5_DTM5_CH1_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5558u)

/** \brief E555C, CDTM5 DTM5 Channel 2 Dead Time Reload Values */
#define GTM_CDTM5_DTM5_CH2_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E555Cu)

/** \brief E5560, CDTM5 DTM5 Channel 3 Dead Time Reload Values */
#define GTM_CDTM5_DTM5_CH3_DTV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV*)0xF01E5560u)

/** \brief E5564, CDTM5 DTM5 Channel Shadow Register */
#define GTM_CDTM5_DTM5_CH_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR*)0xF01E5564u)

