Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EABA4, ATOM5 Channel 7 Interrupt Enable Register */
#define GTM_ATOM5_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EABA4u)

/** \brief EABA8, ATOM5 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM5_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EABA8u)

/** \brief EABAC, ATOM5 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM5_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EABACu)

/** \brief EB000, ATOM6 Channel 0 ARU read address Register */
#define GTM_ATOM6_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB000u)

/** \brief EB004, ATOM6 Channel 0 Control Register */
#define GTM_ATOM6_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB004u)

/** \brief EB004, ATOM6 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM6_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB004u)

/** \brief EB004, ATOM6 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM6_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB004u)

/** \brief EB004, ATOM6 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM6_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB004u)

/** \brief EB004, ATOM6 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM6_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB004u)

/** \brief EB004, ATOM6 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM6_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB004u)

/** \brief EB008, ATOM6 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB008u)

/** \brief EB00C, ATOM6 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB00Cu)

/** \brief EB010, ATOM6 Channel 0 CCU0 Compare Register */
#define GTM_ATOM6_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB010u)

/** \brief EB014, ATOM6 Channel 0 CCU1 Compare Register */
#define GTM_ATOM6_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB014u)

/** \brief EB018, ATOM6 Channel 0 CCU0 Counter Register */
#define GTM_ATOM6_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB018u)

/** \brief EB01C, ATOM6 Channel 0 Status Register */
#define GTM_ATOM6_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB01Cu)

/** \brief EB020, ATOM6 Channel 0 Interrupt Notification Register */
#define GTM_ATOM6_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB020u)

/** \brief EB024, ATOM6 Channel 0 Interrupt Enable Register */
#define GTM_ATOM6_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB024u)

/** \brief EB028, ATOM6 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM6_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB028u)

/** \brief EB02C, ATOM6 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB02Cu)

/** \brief EB040, ATOM6 AGC Global Control Register */
#define GTM_ATOM6_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EB040u)

/** \brief EB044, ATOM6 AGC Enable/Disable Control Register */
#define GTM_ATOM6_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EB044u)

/** \brief EB048, ATOM6 AGC Enable/Disable Status Register */
#define GTM_ATOM6_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EB048u)

/** \brief EB04C, ATOM6 AGC Action Time Base Register */
#define GTM_ATOM6_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EB04Cu)

/** \brief EB050, ATOM6 AGC Output Enable Control Register */
#define GTM_ATOM6_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EB050u)

/** \brief EB054, ATOM6 AGC Output Enable Status Register */
#define GTM_ATOM6_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EB054u)

/** \brief EB058, ATOM6 AGC Force Update Control Register */
#define GTM_ATOM6_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EB058u)

/** \brief EB05C, ATOM6 AGC Internal Trigger Control Register */
#define GTM_ATOM6_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EB05Cu)

/** \brief EB080, ATOM6 Channel 1 ARU read address Register */
#define GTM_ATOM6_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB080u)

/** \brief EB084, ATOM6 Channel 1 Control Register */
#define GTM_ATOM6_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB084u)

/** \brief EB084, ATOM6 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM6_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB084u)

/** \brief EB084, ATOM6 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM6_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB084u)

/** \brief EB084, ATOM6 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM6_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB084u)

/** \brief EB084, ATOM6 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM6_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB084u)

/** \brief EB084, ATOM6 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM6_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB084u)

/** \brief EB088, ATOM6 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB088u)

/** \brief EB08C, ATOM6 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB08Cu)

/** \brief EB090, ATOM6 Channel 1 CCU0 Compare Register */
#define GTM_ATOM6_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB090u)

