Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EB1A0, ATOM6 Channel 3 Interrupt Notification Register */
#define GTM_ATOM6_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB1A0u)

/** \brief EB1A4, ATOM6 Channel 3 Interrupt Enable Register */
#define GTM_ATOM6_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB1A4u)

/** \brief EB1A8, ATOM6 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM6_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB1A8u)

/** \brief EB1AC, ATOM6 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB1ACu)

/** \brief EB200, ATOM6 Channel 4 ARU read address Register */
#define GTM_ATOM6_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB200u)

/** \brief EB204, ATOM6 Channel 4 Control Register */
#define GTM_ATOM6_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB204u)

/** \brief EB204, ATOM6 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM6_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB204u)

/** \brief EB204, ATOM6 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM6_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB204u)

/** \brief EB204, ATOM6 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM6_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB204u)

/** \brief EB204, ATOM6 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM6_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB204u)

/** \brief EB204, ATOM6 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM6_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB204u)

/** \brief EB208, ATOM6 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB208u)

/** \brief EB20C, ATOM6 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB20Cu)

/** \brief EB210, ATOM6 Channel 4 CCU0 Compare Register */
#define GTM_ATOM6_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB210u)

/** \brief EB214, ATOM6 Channel 4 CCU1 Compare Register */
#define GTM_ATOM6_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB214u)

/** \brief EB218, ATOM6 Channel 4 CCU0 Counter Register */
#define GTM_ATOM6_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB218u)

/** \brief EB21C, ATOM6 Channel 4 Status Register */
#define GTM_ATOM6_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB21Cu)

/** \brief EB220, ATOM6 Channel 4 Interrupt Notification Register */
#define GTM_ATOM6_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB220u)

/** \brief EB224, ATOM6 Channel 4 Interrupt Enable Register */
#define GTM_ATOM6_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB224u)

/** \brief EB228, ATOM6 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM6_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB228u)

/** \brief EB22C, ATOM6 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB22Cu)

/** \brief EB280, ATOM6 Channel 5 ARU read address Register */
#define GTM_ATOM6_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB280u)

/** \brief EB284, ATOM6 Channel 5 Control Register */
#define GTM_ATOM6_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB284u)

/** \brief EB284, ATOM6 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM6_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB284u)

/** \brief EB284, ATOM6 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM6_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB284u)

/** \brief EB284, ATOM6 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM6_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB284u)

/** \brief EB284, ATOM6 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM6_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB284u)

/** \brief EB284, ATOM6 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM6_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB284u)

/** \brief EB288, ATOM6 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB288u)

/** \brief EB28C, ATOM6 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB28Cu)

/** \brief EB290, ATOM6 Channel 5 CCU0 Compare Register */
#define GTM_ATOM6_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB290u)

/** \brief EB294, ATOM6 Channel 5 CCU1 Compare Register */
#define GTM_ATOM6_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB294u)

/** \brief EB298, ATOM6 Channel 5 CCU0 Counter Register */
#define GTM_ATOM6_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB298u)

/** \brief EB29C, ATOM6 Channel 5 Status Register */
#define GTM_ATOM6_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB29Cu)

/** \brief EB2A0, ATOM6 Channel 5 Interrupt Notification Register */
#define GTM_ATOM6_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB2A0u)

/** \brief EB2A4, ATOM6 Channel 5 Interrupt Enable Register */
#define GTM_ATOM6_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB2A4u)

/** \brief EB2A8, ATOM6 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM6_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB2A8u)

