Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EB2AC, ATOM6 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB2ACu)

/** \brief EB300, ATOM6 Channel 6 ARU read address Register */
#define GTM_ATOM6_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB300u)

/** \brief EB304, ATOM6 Channel 6 Control Register */
#define GTM_ATOM6_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB304u)

/** \brief EB304, ATOM6 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM6_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB304u)

/** \brief EB304, ATOM6 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM6_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB304u)

/** \brief EB304, ATOM6 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM6_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB304u)

/** \brief EB304, ATOM6 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM6_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB304u)

/** \brief EB304, ATOM6 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM6_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB304u)

/** \brief EB308, ATOM6 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB308u)

/** \brief EB30C, ATOM6 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB30Cu)

/** \brief EB310, ATOM6 Channel 6 CCU0 Compare Register */
#define GTM_ATOM6_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB310u)

/** \brief EB314, ATOM6 Channel 6 CCU1 Compare Register */
#define GTM_ATOM6_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB314u)

/** \brief EB318, ATOM6 Channel 6 CCU0 Counter Register */
#define GTM_ATOM6_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB318u)

/** \brief EB31C, ATOM6 Channel 6 Status Register */
#define GTM_ATOM6_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB31Cu)

/** \brief EB320, ATOM6 Channel 6 Interrupt Notification Register */
#define GTM_ATOM6_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB320u)

/** \brief EB324, ATOM6 Channel 6 Interrupt Enable Register */
#define GTM_ATOM6_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB324u)

/** \brief EB328, ATOM6 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM6_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB328u)

/** \brief EB32C, ATOM6 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB32Cu)

/** \brief EB380, ATOM6 Channel 7 ARU read address Register */
#define GTM_ATOM6_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB380u)

/** \brief EB384, ATOM6 Channel 7 Control Register */
#define GTM_ATOM6_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB384u)

/** \brief EB384, ATOM6 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM6_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EB384u)

/** \brief EB384, ATOM6 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM6_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EB384u)

/** \brief EB384, ATOM6 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM6_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EB384u)

/** \brief EB384, ATOM6 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM6_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EB384u)

/** \brief EB384, ATOM6 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM6_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EB384u)

/** \brief EB388, ATOM6 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EB388u)

/** \brief EB38C, ATOM6 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EB38Cu)

/** \brief EB390, ATOM6 Channel 7 CCU0 Compare Register */
#define GTM_ATOM6_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EB390u)

/** \brief EB394, ATOM6 Channel 7 CCU1 Compare Register */
#define GTM_ATOM6_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EB394u)

/** \brief EB398, ATOM6 Channel 7 CCU0 Counter Register */
#define GTM_ATOM6_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EB398u)

/** \brief EB39C, ATOM6 Channel 7 Status Register */
#define GTM_ATOM6_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EB39Cu)

/** \brief EB3A0, ATOM6 Channel 7 Interrupt Notification Register */
#define GTM_ATOM6_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EB3A0u)

/** \brief EB3A4, ATOM6 Channel 7 Interrupt Enable Register */
#define GTM_ATOM6_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EB3A4u)

/** \brief EB3A8, ATOM6 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM6_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EB3A8u)

/** \brief EB3AC, ATOM6 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM6_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EB3ACu)

/** \brief EB800, ATOM7 Channel 0 ARU read address Register */
#define GTM_ATOM7_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EB800u)

/** \brief EB804, ATOM7 Channel 0 Control Register */
#define GTM_ATOM7_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EB804u)

