Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EBA04, ATOM7 Channel 4 Control Register */
#define GTM_ATOM7_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EBA04u)

/** \brief EBA04, ATOM7 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM7_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EBA04u)

/** \brief EBA04, ATOM7 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM7_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EBA04u)

/** \brief EBA04, ATOM7 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM7_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EBA04u)

/** \brief EBA04, ATOM7 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM7_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EBA04u)

/** \brief EBA04, ATOM7 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM7_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EBA04u)

/** \brief EBA08, ATOM7 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EBA08u)

/** \brief EBA0C, ATOM7 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EBA0Cu)

/** \brief EBA10, ATOM7 Channel 4 CCU0 Compare Register */
#define GTM_ATOM7_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EBA10u)

/** \brief EBA14, ATOM7 Channel 4 CCU1 Compare Register */
#define GTM_ATOM7_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EBA14u)

/** \brief EBA18, ATOM7 Channel 4 CCU0 Counter Register */
#define GTM_ATOM7_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EBA18u)

/** \brief EBA1C, ATOM7 Channel 4 Status Register */
#define GTM_ATOM7_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EBA1Cu)

/** \brief EBA20, ATOM7 Channel 4 Interrupt Notification Register */
#define GTM_ATOM7_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EBA20u)

/** \brief EBA24, ATOM7 Channel 4 Interrupt Enable Register */
#define GTM_ATOM7_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EBA24u)

/** \brief EBA28, ATOM7 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM7_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EBA28u)

/** \brief EBA2C, ATOM7 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EBA2Cu)

/** \brief EBA80, ATOM7 Channel 5 ARU read address Register */
#define GTM_ATOM7_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EBA80u)

/** \brief EBA84, ATOM7 Channel 5 Control Register */
#define GTM_ATOM7_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EBA84u)

/** \brief EBA84, ATOM7 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM7_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EBA84u)

/** \brief EBA84, ATOM7 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM7_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EBA84u)

/** \brief EBA84, ATOM7 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM7_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EBA84u)

/** \brief EBA84, ATOM7 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM7_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EBA84u)

/** \brief EBA84, ATOM7 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM7_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EBA84u)

/** \brief EBA88, ATOM7 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EBA88u)

/** \brief EBA8C, ATOM7 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EBA8Cu)

/** \brief EBA90, ATOM7 Channel 5 CCU0 Compare Register */
#define GTM_ATOM7_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EBA90u)

/** \brief EBA94, ATOM7 Channel 5 CCU1 Compare Register */
#define GTM_ATOM7_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EBA94u)

/** \brief EBA98, ATOM7 Channel 5 CCU0 Counter Register */
#define GTM_ATOM7_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EBA98u)

/** \brief EBA9C, ATOM7 Channel 5 Status Register */
#define GTM_ATOM7_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EBA9Cu)

/** \brief EBAA0, ATOM7 Channel 5 Interrupt Notification Register */
#define GTM_ATOM7_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EBAA0u)

/** \brief EBAA4, ATOM7 Channel 5 Interrupt Enable Register */
#define GTM_ATOM7_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EBAA4u)

/** \brief EBAA8, ATOM7 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM7_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EBAA8u)

/** \brief EBAAC, ATOM7 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM7_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EBAACu)

/** \brief EBB00, ATOM7 Channel 6 ARU read address Register */
#define GTM_ATOM7_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EBB00u)

/** \brief EBB04, ATOM7 Channel 6 Control Register */
#define GTM_ATOM7_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EBB04u)

/** \brief EBB04, ATOM7 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM7_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EBB04u)

/** \brief EBB04, ATOM7 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM7_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EBB04u)

/** \brief EBB04, ATOM7 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM7_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EBB04u)

/** \brief EBB04, ATOM7 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM7_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EBB04u)

