Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EC010, ATOM8 Channel 0 CCU0 Compare Register */
#define GTM_ATOM8_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC010u)

/** \brief EC014, ATOM8 Channel 0 CCU1 Compare Register */
#define GTM_ATOM8_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC014u)

/** \brief EC018, ATOM8 Channel 0 CCU0 Counter Register */
#define GTM_ATOM8_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC018u)

/** \brief EC01C, ATOM8 Channel 0 Status Register */
#define GTM_ATOM8_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC01Cu)

/** \brief EC020, ATOM8 Channel 0 Interrupt Notification Register */
#define GTM_ATOM8_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC020u)

/** \brief EC024, ATOM8 Channel 0 Interrupt Enable Register */
#define GTM_ATOM8_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC024u)

/** \brief EC028, ATOM8 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM8_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC028u)

/** \brief EC02C, ATOM8 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC02Cu)

/** \brief EC040, ATOM8 AGC Global Control Register */
#define GTM_ATOM8_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EC040u)

/** \brief EC044, ATOM8 AGC Enable/Disable Control Register */
#define GTM_ATOM8_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EC044u)

/** \brief EC048, ATOM8 AGC Enable/Disable Status Register */
#define GTM_ATOM8_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EC048u)

/** \brief EC04C, ATOM8 AGC Action Time Base Register */
#define GTM_ATOM8_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EC04Cu)

/** \brief EC050, ATOM8 AGC Output Enable Control Register */
#define GTM_ATOM8_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EC050u)

/** \brief EC054, ATOM8 AGC Output Enable Status Register */
#define GTM_ATOM8_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EC054u)

/** \brief EC058, ATOM8 AGC Force Update Control Register */
#define GTM_ATOM8_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EC058u)

/** \brief EC05C, ATOM8 AGC Internal Trigger Control Register */
#define GTM_ATOM8_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EC05Cu)

/** \brief EC080, ATOM8 Channel 1 ARU read address Register */
#define GTM_ATOM8_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC080u)

/** \brief EC084, ATOM8 Channel 1 Control Register */
#define GTM_ATOM8_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC084u)

/** \brief EC084, ATOM8 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM8_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC084u)

/** \brief EC084, ATOM8 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM8_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC084u)

/** \brief EC084, ATOM8 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM8_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC084u)

/** \brief EC084, ATOM8 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM8_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC084u)

/** \brief EC084, ATOM8 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM8_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EC084u)

/** \brief EC088, ATOM8 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EC088u)

/** \brief EC08C, ATOM8 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EC08Cu)

/** \brief EC090, ATOM8 Channel 1 CCU0 Compare Register */
#define GTM_ATOM8_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EC090u)

/** \brief EC094, ATOM8 Channel 1 CCU1 Compare Register */
#define GTM_ATOM8_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EC094u)

/** \brief EC098, ATOM8 Channel 1 CCU0 Counter Register */
#define GTM_ATOM8_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EC098u)

/** \brief EC09C, ATOM8 Channel 1 Status Register */
#define GTM_ATOM8_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EC09Cu)

/** \brief EC0A0, ATOM8 Channel 1 Interrupt Notification Register */
#define GTM_ATOM8_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EC0A0u)

/** \brief EC0A4, ATOM8 Channel 1 Interrupt Enable Register */
#define GTM_ATOM8_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EC0A4u)

/** \brief EC0A8, ATOM8 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM8_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EC0A8u)

/** \brief EC0AC, ATOM8 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM8_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EC0ACu)

/** \brief EC100, ATOM8 Channel 2 ARU read address Register */
#define GTM_ATOM8_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EC100u)

/** \brief EC104, ATOM8 Channel 2 Control Register */
#define GTM_ATOM8_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EC104u)

/** \brief EC104, ATOM8 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM8_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EC104u)

/** \brief EC104, ATOM8 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM8_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EC104u)

/** \brief EC104, ATOM8 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM8_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EC104u)

/** \brief EC104, ATOM8 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM8_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EC104u)

