Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief ED004, ATOM10 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM10_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED004u)

/** \brief ED004, ATOM10 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM10_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED004u)

/** \brief ED004, ATOM10 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM10_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED004u)

/** \brief ED004, ATOM10 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM10_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED004u)

/** \brief ED004, ATOM10 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM10_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED004u)

/** \brief ED008, ATOM10 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED008u)

/** \brief ED00C, ATOM10 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED00Cu)

/** \brief ED010, ATOM10 Channel 0 CCU0 Compare Register */
#define GTM_ATOM10_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED010u)

/** \brief ED014, ATOM10 Channel 0 CCU1 Compare Register */
#define GTM_ATOM10_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED014u)

/** \brief ED018, ATOM10 Channel 0 CCU0 Counter Register */
#define GTM_ATOM10_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED018u)

/** \brief ED01C, ATOM10 Channel 0 Status Register */
#define GTM_ATOM10_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED01Cu)

/** \brief ED020, ATOM10 Channel 0 Interrupt Notification Register */
#define GTM_ATOM10_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED020u)

/** \brief ED024, ATOM10 Channel 0 Interrupt Enable Register */
#define GTM_ATOM10_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED024u)

/** \brief ED028, ATOM10 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM10_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED028u)

/** \brief ED02C, ATOM10 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED02Cu)

/** \brief ED040, ATOM10 AGC Global Control Register */
#define GTM_ATOM10_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01ED040u)

/** \brief ED044, ATOM10 AGC Enable/Disable Control Register */
#define GTM_ATOM10_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01ED044u)

/** \brief ED048, ATOM10 AGC Enable/Disable Status Register */
#define GTM_ATOM10_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01ED048u)

/** \brief ED04C, ATOM10 AGC Action Time Base Register */
#define GTM_ATOM10_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01ED04Cu)

/** \brief ED050, ATOM10 AGC Output Enable Control Register */
#define GTM_ATOM10_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01ED050u)

/** \brief ED054, ATOM10 AGC Output Enable Status Register */
#define GTM_ATOM10_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01ED054u)

/** \brief ED058, ATOM10 AGC Force Update Control Register */
#define GTM_ATOM10_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01ED058u)

/** \brief ED05C, ATOM10 AGC Internal Trigger Control Register */
#define GTM_ATOM10_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01ED05Cu)

/** \brief ED080, ATOM10 Channel 1 ARU read address Register */
#define GTM_ATOM10_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED080u)

/** \brief ED084, ATOM10 Channel 1 Control Register */
#define GTM_ATOM10_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED084u)

/** \brief ED084, ATOM10 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM10_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED084u)

/** \brief ED084, ATOM10 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM10_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED084u)

/** \brief ED084, ATOM10 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM10_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED084u)

/** \brief ED084, ATOM10 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM10_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED084u)

/** \brief ED084, ATOM10 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM10_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED084u)

/** \brief ED088, ATOM10 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED088u)

/** \brief ED08C, ATOM10 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED08Cu)

/** \brief ED090, ATOM10 Channel 1 CCU0 Compare Register */
#define GTM_ATOM10_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED090u)

/** \brief ED094, ATOM10 Channel 1 CCU1 Compare Register */
#define GTM_ATOM10_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED094u)

/** \brief ED098, ATOM10 Channel 1 CCU0 Counter Register */
#define GTM_ATOM10_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED098u)

/** \brief ED09C, ATOM10 Channel 1 Status Register */
#define GTM_ATOM10_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED09Cu)

/** \brief ED0A0, ATOM10 Channel 1 Interrupt Notification Register */
#define GTM_ATOM10_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED0A0u)

/** \brief ED0A4, ATOM10 Channel 1 Interrupt Enable Register */
#define GTM_ATOM10_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED0A4u)

/** \brief ED0A8, ATOM10 Channel 1 Software Interrupt Generation Register */
#define GTM_ATOM10_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED0A8u)

/** \brief ED0AC, ATOM10 Channel 1 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED0ACu)

/** \brief ED100, ATOM10 Channel 2 ARU read address Register */
#define GTM_ATOM10_CH2_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED100u)

/** \brief ED104, ATOM10 Channel 2 Control Register */
#define GTM_ATOM10_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED104u)

/** \brief ED104, ATOM10 Channel 2 Control Register in SOMB Mode */
#define GTM_ATOM10_CH2_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED104u)

/** \brief ED104, ATOM10 Channel 2 Control Register in SOMC Mode */
#define GTM_ATOM10_CH2_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED104u)

/** \brief ED104, ATOM10 Channel 2 Control Register in SOMI Mode */
#define GTM_ATOM10_CH2_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED104u)

/** \brief ED104, ATOM10 Channel 2 Control Register in SOMP Mode */
#define GTM_ATOM10_CH2_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED104u)

