Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief ED20C, ATOM10 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED20Cu)

/** \brief ED210, ATOM10 Channel 4 CCU0 Compare Register */
#define GTM_ATOM10_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED210u)

/** \brief ED214, ATOM10 Channel 4 CCU1 Compare Register */
#define GTM_ATOM10_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED214u)

/** \brief ED218, ATOM10 Channel 4 CCU0 Counter Register */
#define GTM_ATOM10_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED218u)

/** \brief ED21C, ATOM10 Channel 4 Status Register */
#define GTM_ATOM10_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED21Cu)

/** \brief ED220, ATOM10 Channel 4 Interrupt Notification Register */
#define GTM_ATOM10_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED220u)

/** \brief ED224, ATOM10 Channel 4 Interrupt Enable Register */
#define GTM_ATOM10_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED224u)

/** \brief ED228, ATOM10 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM10_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED228u)

/** \brief ED22C, ATOM10 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED22Cu)

/** \brief ED280, ATOM10 Channel 5 ARU read address Register */
#define GTM_ATOM10_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED280u)

/** \brief ED284, ATOM10 Channel 5 Control Register */
#define GTM_ATOM10_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED284u)

/** \brief ED284, ATOM10 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM10_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED284u)

/** \brief ED284, ATOM10 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM10_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED284u)

/** \brief ED284, ATOM10 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM10_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED284u)

/** \brief ED284, ATOM10 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM10_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED284u)

/** \brief ED284, ATOM10 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM10_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED284u)

/** \brief ED288, ATOM10 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED288u)

/** \brief ED28C, ATOM10 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED28Cu)

/** \brief ED290, ATOM10 Channel 5 CCU0 Compare Register */
#define GTM_ATOM10_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED290u)

/** \brief ED294, ATOM10 Channel 5 CCU1 Compare Register */
#define GTM_ATOM10_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED294u)

/** \brief ED298, ATOM10 Channel 5 CCU0 Counter Register */
#define GTM_ATOM10_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED298u)

/** \brief ED29C, ATOM10 Channel 5 Status Register */
#define GTM_ATOM10_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED29Cu)

/** \brief ED2A0, ATOM10 Channel 5 Interrupt Notification Register */
#define GTM_ATOM10_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED2A0u)

/** \brief ED2A4, ATOM10 Channel 5 Interrupt Enable Register */
#define GTM_ATOM10_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED2A4u)

/** \brief ED2A8, ATOM10 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM10_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED2A8u)

/** \brief ED2AC, ATOM10 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED2ACu)

/** \brief ED300, ATOM10 Channel 6 ARU read address Register */
#define GTM_ATOM10_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED300u)

/** \brief ED304, ATOM10 Channel 6 Control Register */
#define GTM_ATOM10_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED304u)

/** \brief ED304, ATOM10 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM10_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED304u)

/** \brief ED304, ATOM10 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM10_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED304u)

/** \brief ED304, ATOM10 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM10_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED304u)

/** \brief ED304, ATOM10 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM10_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED304u)

/** \brief ED304, ATOM10 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM10_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED304u)

/** \brief ED308, ATOM10 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED308u)

/** \brief ED30C, ATOM10 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED30Cu)

/** \brief ED310, ATOM10 Channel 6 CCU0 Compare Register */
#define GTM_ATOM10_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED310u)

/** \brief ED314, ATOM10 Channel 6 CCU1 Compare Register */
#define GTM_ATOM10_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED314u)

/** \brief ED318, ATOM10 Channel 6 CCU0 Counter Register */
#define GTM_ATOM10_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED318u)

