Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief ED31C, ATOM10 Channel 6 Status Register */
#define GTM_ATOM10_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED31Cu)

/** \brief ED320, ATOM10 Channel 6 Interrupt Notification Register */
#define GTM_ATOM10_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED320u)

/** \brief ED324, ATOM10 Channel 6 Interrupt Enable Register */
#define GTM_ATOM10_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED324u)

/** \brief ED328, ATOM10 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM10_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED328u)

/** \brief ED32C, ATOM10 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED32Cu)

/** \brief ED380, ATOM10 Channel 7 ARU read address Register */
#define GTM_ATOM10_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED380u)

/** \brief ED384, ATOM10 Channel 7 Control Register */
#define GTM_ATOM10_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED384u)

/** \brief ED384, ATOM10 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM10_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED384u)

/** \brief ED384, ATOM10 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM10_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED384u)

/** \brief ED384, ATOM10 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM10_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED384u)

/** \brief ED384, ATOM10 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM10_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED384u)

/** \brief ED384, ATOM10 Channel 7 Control Register in SOMS Mode */
#define GTM_ATOM10_CH7_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED384u)

/** \brief ED388, ATOM10 Channel 7 CCU0 Compare Shadow Register */
#define GTM_ATOM10_CH7_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED388u)

/** \brief ED38C, ATOM10 Channel 7 CCU1 Compare Shadow Register */
#define GTM_ATOM10_CH7_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED38Cu)

/** \brief ED390, ATOM10 Channel 7 CCU0 Compare Register */
#define GTM_ATOM10_CH7_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED390u)

/** \brief ED394, ATOM10 Channel 7 CCU1 Compare Register */
#define GTM_ATOM10_CH7_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED394u)

/** \brief ED398, ATOM10 Channel 7 CCU0 Counter Register */
#define GTM_ATOM10_CH7_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED398u)

/** \brief ED39C, ATOM10 Channel 7 Status Register */
#define GTM_ATOM10_CH7_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED39Cu)

/** \brief ED3A0, ATOM10 Channel 7 Interrupt Notification Register */
#define GTM_ATOM10_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED3A0u)

/** \brief ED3A4, ATOM10 Channel 7 Interrupt Enable Register */
#define GTM_ATOM10_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED3A4u)

/** \brief ED3A8, ATOM10 Channel 7 Software Interrupt Generation Register */
#define GTM_ATOM10_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED3A8u)

/** \brief ED3AC, ATOM10 Channel 7 Interrupt Mode Configuration Register */
#define GTM_ATOM10_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED3ACu)

/** \brief ED800, ATOM11 Channel 0 ARU read address Register */
#define GTM_ATOM11_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED800u)

/** \brief ED804, ATOM11 Channel 0 Control Register */
#define GTM_ATOM11_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED804u)

/** \brief ED804, ATOM11 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM11_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED804u)

/** \brief ED804, ATOM11 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM11_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED804u)

/** \brief ED804, ATOM11 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM11_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED804u)

/** \brief ED804, ATOM11 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM11_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED804u)

/** \brief ED804, ATOM11 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM11_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED804u)

/** \brief ED808, ATOM11 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED808u)

/** \brief ED80C, ATOM11 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED80Cu)

/** \brief ED810, ATOM11 Channel 0 CCU0 Compare Register */
#define GTM_ATOM11_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED810u)

/** \brief ED814, ATOM11 Channel 0 CCU1 Compare Register */
#define GTM_ATOM11_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED814u)

/** \brief ED818, ATOM11 Channel 0 CCU0 Counter Register */
#define GTM_ATOM11_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED818u)

/** \brief ED81C, ATOM11 Channel 0 Status Register */
#define GTM_ATOM11_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED81Cu)

/** \brief ED820, ATOM11 Channel 0 Interrupt Notification Register */
#define GTM_ATOM11_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED820u)

/** \brief ED824, ATOM11 Channel 0 Interrupt Enable Register */
#define GTM_ATOM11_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED824u)

/** \brief ED828, ATOM11 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM11_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED828u)

