Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief ED928, ATOM11 Channel 2 Software Interrupt Generation Register */
#define GTM_ATOM11_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED928u)

/** \brief ED92C, ATOM11 Channel 2 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED92Cu)

/** \brief ED980, ATOM11 Channel 3 ARU read address Register */
#define GTM_ATOM11_CH3_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01ED980u)

/** \brief ED984, ATOM11 Channel 3 Control Register */
#define GTM_ATOM11_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01ED984u)

/** \brief ED984, ATOM11 Channel 3 Control Register in SOMB Mode */
#define GTM_ATOM11_CH3_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01ED984u)

/** \brief ED984, ATOM11 Channel 3 Control Register in SOMC Mode */
#define GTM_ATOM11_CH3_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01ED984u)

/** \brief ED984, ATOM11 Channel 3 Control Register in SOMI Mode */
#define GTM_ATOM11_CH3_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01ED984u)

/** \brief ED984, ATOM11 Channel 3 Control Register in SOMP Mode */
#define GTM_ATOM11_CH3_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01ED984u)

/** \brief ED984, ATOM11 Channel 3 Control Register in SOMS Mode */
#define GTM_ATOM11_CH3_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01ED984u)

/** \brief ED988, ATOM11 Channel 3 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01ED988u)

/** \brief ED98C, ATOM11 Channel 3 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01ED98Cu)

/** \brief ED990, ATOM11 Channel 3 CCU0 Compare Register */
#define GTM_ATOM11_CH3_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01ED990u)

/** \brief ED994, ATOM11 Channel 3 CCU1 Compare Register */
#define GTM_ATOM11_CH3_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01ED994u)

/** \brief ED998, ATOM11 Channel 3 CCU0 Counter Register */
#define GTM_ATOM11_CH3_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01ED998u)

/** \brief ED99C, ATOM11 Channel 3 Status Register */
#define GTM_ATOM11_CH3_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01ED99Cu)

/** \brief ED9A0, ATOM11 Channel 3 Interrupt Notification Register */
#define GTM_ATOM11_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01ED9A0u)

/** \brief ED9A4, ATOM11 Channel 3 Interrupt Enable Register */
#define GTM_ATOM11_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01ED9A4u)

/** \brief ED9A8, ATOM11 Channel 3 Software Interrupt Generation Register */
#define GTM_ATOM11_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01ED9A8u)

/** \brief ED9AC, ATOM11 Channel 3 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01ED9ACu)

/** \brief EDA00, ATOM11 Channel 4 ARU read address Register */
#define GTM_ATOM11_CH4_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EDA00u)

/** \brief EDA04, ATOM11 Channel 4 Control Register */
#define GTM_ATOM11_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EDA04u)

/** \brief EDA04, ATOM11 Channel 4 Control Register in SOMB Mode */
#define GTM_ATOM11_CH4_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EDA04u)

/** \brief EDA04, ATOM11 Channel 4 Control Register in SOMC Mode */
#define GTM_ATOM11_CH4_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EDA04u)

/** \brief EDA04, ATOM11 Channel 4 Control Register in SOMI Mode */
#define GTM_ATOM11_CH4_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EDA04u)

/** \brief EDA04, ATOM11 Channel 4 Control Register in SOMP Mode */
#define GTM_ATOM11_CH4_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EDA04u)

/** \brief EDA04, ATOM11 Channel 4 Control Register in SOMS Mode */
#define GTM_ATOM11_CH4_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EDA04u)

/** \brief EDA08, ATOM11 Channel 4 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EDA08u)

/** \brief EDA0C, ATOM11 Channel 4 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EDA0Cu)

/** \brief EDA10, ATOM11 Channel 4 CCU0 Compare Register */
#define GTM_ATOM11_CH4_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EDA10u)

/** \brief EDA14, ATOM11 Channel 4 CCU1 Compare Register */
#define GTM_ATOM11_CH4_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EDA14u)

/** \brief EDA18, ATOM11 Channel 4 CCU0 Counter Register */
#define GTM_ATOM11_CH4_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EDA18u)

/** \brief EDA1C, ATOM11 Channel 4 Status Register */
#define GTM_ATOM11_CH4_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EDA1Cu)

/** \brief EDA20, ATOM11 Channel 4 Interrupt Notification Register */
#define GTM_ATOM11_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EDA20u)

/** \brief EDA24, ATOM11 Channel 4 Interrupt Enable Register */
#define GTM_ATOM11_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EDA24u)

/** \brief EDA28, ATOM11 Channel 4 Software Interrupt Generation Register */
#define GTM_ATOM11_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EDA28u)

/** \brief EDA2C, ATOM11 Channel 4 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EDA2Cu)

/** \brief EDA80, ATOM11 Channel 5 ARU read address Register */
#define GTM_ATOM11_CH5_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EDA80u)

/** \brief EDA84, ATOM11 Channel 5 Control Register */
#define GTM_ATOM11_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EDA84u)

