Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief EDA84, ATOM11 Channel 5 Control Register in SOMB Mode */
#define GTM_ATOM11_CH5_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EDA84u)

/** \brief EDA84, ATOM11 Channel 5 Control Register in SOMC Mode */
#define GTM_ATOM11_CH5_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EDA84u)

/** \brief EDA84, ATOM11 Channel 5 Control Register in SOMI Mode */
#define GTM_ATOM11_CH5_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EDA84u)

/** \brief EDA84, ATOM11 Channel 5 Control Register in SOMP Mode */
#define GTM_ATOM11_CH5_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EDA84u)

/** \brief EDA84, ATOM11 Channel 5 Control Register in SOMS Mode */
#define GTM_ATOM11_CH5_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EDA84u)

/** \brief EDA88, ATOM11 Channel 5 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EDA88u)

/** \brief EDA8C, ATOM11 Channel 5 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EDA8Cu)

/** \brief EDA90, ATOM11 Channel 5 CCU0 Compare Register */
#define GTM_ATOM11_CH5_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EDA90u)

/** \brief EDA94, ATOM11 Channel 5 CCU1 Compare Register */
#define GTM_ATOM11_CH5_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EDA94u)

/** \brief EDA98, ATOM11 Channel 5 CCU0 Counter Register */
#define GTM_ATOM11_CH5_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EDA98u)

/** \brief EDA9C, ATOM11 Channel 5 Status Register */
#define GTM_ATOM11_CH5_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EDA9Cu)

/** \brief EDAA0, ATOM11 Channel 5 Interrupt Notification Register */
#define GTM_ATOM11_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EDAA0u)

/** \brief EDAA4, ATOM11 Channel 5 Interrupt Enable Register */
#define GTM_ATOM11_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EDAA4u)

/** \brief EDAA8, ATOM11 Channel 5 Software Interrupt Generation Register */
#define GTM_ATOM11_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EDAA8u)

/** \brief EDAAC, ATOM11 Channel 5 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EDAACu)

/** \brief EDB00, ATOM11 Channel 6 ARU read address Register */
#define GTM_ATOM11_CH6_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EDB00u)

/** \brief EDB04, ATOM11 Channel 6 Control Register */
#define GTM_ATOM11_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EDB04u)

/** \brief EDB04, ATOM11 Channel 6 Control Register in SOMB Mode */
#define GTM_ATOM11_CH6_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EDB04u)

/** \brief EDB04, ATOM11 Channel 6 Control Register in SOMC Mode */
#define GTM_ATOM11_CH6_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EDB04u)

/** \brief EDB04, ATOM11 Channel 6 Control Register in SOMI Mode */
#define GTM_ATOM11_CH6_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EDB04u)

/** \brief EDB04, ATOM11 Channel 6 Control Register in SOMP Mode */
#define GTM_ATOM11_CH6_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EDB04u)

/** \brief EDB04, ATOM11 Channel 6 Control Register in SOMS Mode */
#define GTM_ATOM11_CH6_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EDB04u)

/** \brief EDB08, ATOM11 Channel 6 CCU0 Compare Shadow Register */
#define GTM_ATOM11_CH6_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EDB08u)

/** \brief EDB0C, ATOM11 Channel 6 CCU1 Compare Shadow Register */
#define GTM_ATOM11_CH6_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EDB0Cu)

/** \brief EDB10, ATOM11 Channel 6 CCU0 Compare Register */
#define GTM_ATOM11_CH6_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EDB10u)

/** \brief EDB14, ATOM11 Channel 6 CCU1 Compare Register */
#define GTM_ATOM11_CH6_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EDB14u)

/** \brief EDB18, ATOM11 Channel 6 CCU0 Counter Register */
#define GTM_ATOM11_CH6_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EDB18u)

/** \brief EDB1C, ATOM11 Channel 6 Status Register */
#define GTM_ATOM11_CH6_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EDB1Cu)

/** \brief EDB20, ATOM11 Channel 6 Interrupt Notification Register */
#define GTM_ATOM11_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EDB20u)

/** \brief EDB24, ATOM11 Channel 6 Interrupt Enable Register */
#define GTM_ATOM11_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EDB24u)

/** \brief EDB28, ATOM11 Channel 6 Software Interrupt Generation Register */
#define GTM_ATOM11_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EDB28u)

/** \brief EDB2C, ATOM11 Channel 6 Interrupt Mode Configuration Register */
#define GTM_ATOM11_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EDB2Cu)

/** \brief EDB80, ATOM11 Channel 7 ARU read address Register */
#define GTM_ATOM11_CH7_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EDB80u)

/** \brief EDB84, ATOM11 Channel 7 Control Register */
#define GTM_ATOM11_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EDB84u)

/** \brief EDB84, ATOM11 Channel 7 Control Register in SOMB Mode */
#define GTM_ATOM11_CH7_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EDB84u)

/** \brief EDB84, ATOM11 Channel 7 Control Register in SOMC Mode */
#define GTM_ATOM11_CH7_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EDB84u)

/** \brief EDB84, ATOM11 Channel 7 Control Register in SOMI Mode */
#define GTM_ATOM11_CH7_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EDB84u)

/** \brief EDB84, ATOM11 Channel 7 Control Register in SOMP Mode */
#define GTM_ATOM11_CH7_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EDB84u)

