Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F3098, MCS3 Channel 1 General Purpose Register 6 */
#define GTM_MCS3_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3098u)

/** \brief F309C, MCS3 Channel 1 General Purpose Register 7 */
#define GTM_MCS3_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F309Cu)

/** \brief F30A0, MCS3 Channel 1 Control Register */
#define GTM_MCS3_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F30A0u)

/** \brief F30A4, MCS3 Channel 1 ARU Control Bit Register */
#define GTM_MCS3_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F30A4u)

/** \brief F30BC, MCS3 Channel 1 Memory High Byte Register */
#define GTM_MCS3_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F30BCu)

/** \brief F30C0, MCS3 Channel 1 Program Counter Register */
#define GTM_MCS3_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F30C0u)

/** \brief F30C4, MCS3 Channel 1 Interrupt Notification Register */
#define GTM_MCS3_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F30C4u)

/** \brief F30C8, MCS3 Channel 1 Interrupt Enable Register */
#define GTM_MCS3_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F30C8u)

/** \brief F30CC, MCS3 Channel 1 Force Interrupt Register */
#define GTM_MCS3_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F30CCu)

/** \brief F30D0, MCS3 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS3_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F30D0u)

/** \brief F30D4, MCS3 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS3_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F30D4u)

/** \brief F3100, MCS3 Channel 2 General Purpose Register 0 */
#define GTM_MCS3_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3100u)

/** \brief F3104, MCS3 Channel 2 General Purpose Register 1 */
#define GTM_MCS3_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3104u)

/** \brief F3108, MCS3 Channel 2 General Purpose Register 2 */
#define GTM_MCS3_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3108u)

/** \brief F310C, MCS3 Channel 2 General Purpose Register 3 */
#define GTM_MCS3_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F310Cu)

/** \brief F3110, MCS3 Channel 2 General Purpose Register 4 */
#define GTM_MCS3_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3110u)

/** \brief F3114, MCS3 Channel 2 General Purpose Register 5 */
#define GTM_MCS3_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3114u)

/** \brief F3118, MCS3 Channel 2 General Purpose Register 6 */
#define GTM_MCS3_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3118u)

/** \brief F311C, MCS3 Channel 2 General Purpose Register 7 */
#define GTM_MCS3_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F311Cu)

/** \brief F3120, MCS3 Channel 2 Control Register */
#define GTM_MCS3_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F3120u)

/** \brief F3124, MCS3 Channel 2 ARU Control Bit Register */
#define GTM_MCS3_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F3124u)

/** \brief F313C, MCS3 Channel 2 Memory High Byte Register */
#define GTM_MCS3_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F313Cu)

/** \brief F3140, MCS3 Channel 2 Program Counter Register */
#define GTM_MCS3_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F3140u)

/** \brief F3144, MCS3 Channel 2 Interrupt Notification Register */
#define GTM_MCS3_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F3144u)

/** \brief F3148, MCS3 Channel 2 Interrupt Enable Register */
#define GTM_MCS3_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F3148u)

/** \brief F314C, MCS3 Channel 2 Force Interrupt Register */
#define GTM_MCS3_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F314Cu)

/** \brief F3150, MCS3 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS3_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F3150u)

/** \brief F3154, MCS3 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS3_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F3154u)

/** \brief F3180, MCS3 Channel 3 General Purpose Register 0 */
#define GTM_MCS3_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3180u)

/** \brief F3184, MCS3 Channel 3 General Purpose Register 1 */
#define GTM_MCS3_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3184u)

/** \brief F3188, MCS3 Channel 3 General Purpose Register 2 */
#define GTM_MCS3_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3188u)

/** \brief F318C, MCS3 Channel 3 General Purpose Register 3 */
#define GTM_MCS3_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F318Cu)

/** \brief F3190, MCS3 Channel 3 General Purpose Register 4 */
#define GTM_MCS3_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3190u)

/** \brief F3194, MCS3 Channel 3 General Purpose Register 5 */
#define GTM_MCS3_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3194u)

/** \brief F3198, MCS3 Channel 3 General Purpose Register 6 */
#define GTM_MCS3_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F3198u)

/** \brief F319C, MCS3 Channel 3 General Purpose Register 7 */
#define GTM_MCS3_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F319Cu)

/** \brief F31A0, MCS3 Channel 3 Control Register */
#define GTM_MCS3_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F31A0u)

/** \brief F31A4, MCS3 Channel 3 ARU Control Bit Register */
#define GTM_MCS3_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F31A4u)

