Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F60BC, MCS6 Channel 1 Memory High Byte Register */
#define GTM_MCS6_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F60BCu)

/** \brief F60C0, MCS6 Channel 1 Program Counter Register */
#define GTM_MCS6_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F60C0u)

/** \brief F60C4, MCS6 Channel 1 Interrupt Notification Register */
#define GTM_MCS6_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F60C4u)

/** \brief F60C8, MCS6 Channel 1 Interrupt Enable Register */
#define GTM_MCS6_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F60C8u)

/** \brief F60CC, MCS6 Channel 1 Force Interrupt Register */
#define GTM_MCS6_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F60CCu)

/** \brief F60D0, MCS6 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F60D0u)

/** \brief F60D4, MCS6 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS6_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F60D4u)

/** \brief F6100, MCS6 Channel 2 General Purpose Register 0 */
#define GTM_MCS6_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6100u)

/** \brief F6104, MCS6 Channel 2 General Purpose Register 1 */
#define GTM_MCS6_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6104u)

/** \brief F6108, MCS6 Channel 2 General Purpose Register 2 */
#define GTM_MCS6_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6108u)

/** \brief F610C, MCS6 Channel 2 General Purpose Register 3 */
#define GTM_MCS6_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F610Cu)

/** \brief F6110, MCS6 Channel 2 General Purpose Register 4 */
#define GTM_MCS6_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6110u)

/** \brief F6114, MCS6 Channel 2 General Purpose Register 5 */
#define GTM_MCS6_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6114u)

/** \brief F6118, MCS6 Channel 2 General Purpose Register 6 */
#define GTM_MCS6_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6118u)

/** \brief F611C, MCS6 Channel 2 General Purpose Register 7 */
#define GTM_MCS6_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F611Cu)

/** \brief F6120, MCS6 Channel 2 Control Register */
#define GTM_MCS6_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F6120u)

/** \brief F6124, MCS6 Channel 2 ARU Control Bit Register */
#define GTM_MCS6_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F6124u)

/** \brief F613C, MCS6 Channel 2 Memory High Byte Register */
#define GTM_MCS6_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F613Cu)

/** \brief F6140, MCS6 Channel 2 Program Counter Register */
#define GTM_MCS6_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F6140u)

/** \brief F6144, MCS6 Channel 2 Interrupt Notification Register */
#define GTM_MCS6_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F6144u)

/** \brief F6148, MCS6 Channel 2 Interrupt Enable Register */
#define GTM_MCS6_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F6148u)

/** \brief F614C, MCS6 Channel 2 Force Interrupt Register */
#define GTM_MCS6_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F614Cu)

/** \brief F6150, MCS6 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F6150u)

/** \brief F6154, MCS6 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS6_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F6154u)

/** \brief F6180, MCS6 Channel 3 General Purpose Register 0 */
#define GTM_MCS6_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6180u)

/** \brief F6184, MCS6 Channel 3 General Purpose Register 1 */
#define GTM_MCS6_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6184u)

/** \brief F6188, MCS6 Channel 3 General Purpose Register 2 */
#define GTM_MCS6_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6188u)

/** \brief F618C, MCS6 Channel 3 General Purpose Register 3 */
#define GTM_MCS6_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F618Cu)

/** \brief F6190, MCS6 Channel 3 General Purpose Register 4 */
#define GTM_MCS6_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6190u)

/** \brief F6194, MCS6 Channel 3 General Purpose Register 5 */
#define GTM_MCS6_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6194u)

/** \brief F6198, MCS6 Channel 3 General Purpose Register 6 */
#define GTM_MCS6_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6198u)

/** \brief F619C, MCS6 Channel 3 General Purpose Register 7 */
#define GTM_MCS6_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F619Cu)

/** \brief F61A0, MCS6 Channel 3 Control Register */
#define GTM_MCS6_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F61A0u)

/** \brief F61A4, MCS6 Channel 3 ARU Control Bit Register */
#define GTM_MCS6_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F61A4u)

/** \brief F61BC, MCS6 Channel 3 Memory High Byte Register */
#define GTM_MCS6_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F61BCu)

/** \brief F61C0, MCS6 Channel 3 Program Counter Register */
#define GTM_MCS6_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F61C0u)

/** \brief F61C4, MCS6 Channel 3 Interrupt Notification Register */
#define GTM_MCS6_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F61C4u)

/** \brief F61C8, MCS6 Channel 3 Interrupt Enable Register */
#define GTM_MCS6_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F61C8u)

