Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F6308, MCS6 Channel 6 General Purpose Register 2 */
#define GTM_MCS6_CH6_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6308u)

/** \brief F630C, MCS6 Channel 6 General Purpose Register 3 */
#define GTM_MCS6_CH6_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F630Cu)

/** \brief F6310, MCS6 Channel 6 General Purpose Register 4 */
#define GTM_MCS6_CH6_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6310u)

/** \brief F6314, MCS6 Channel 6 General Purpose Register 5 */
#define GTM_MCS6_CH6_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6314u)

/** \brief F6318, MCS6 Channel 6 General Purpose Register 6 */
#define GTM_MCS6_CH6_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6318u)

/** \brief F631C, MCS6 Channel 6 General Purpose Register 7 */
#define GTM_MCS6_CH6_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F631Cu)

/** \brief F6320, MCS6 Channel 6 Control Register */
#define GTM_MCS6_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F6320u)

/** \brief F6324, MCS6 Channel 6 ARU Control Bit Register */
#define GTM_MCS6_CH6_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F6324u)

/** \brief F633C, MCS6 Channel 6 Memory High Byte Register */
#define GTM_MCS6_CH6_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F633Cu)

/** \brief F6340, MCS6 Channel 6 Program Counter Register */
#define GTM_MCS6_CH6_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F6340u)

/** \brief F6344, MCS6 Channel 6 Interrupt Notification Register */
#define GTM_MCS6_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F6344u)

/** \brief F6348, MCS6 Channel 6 Interrupt Enable Register */
#define GTM_MCS6_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F6348u)

/** \brief F634C, MCS6 Channel 6 Force Interrupt Register */
#define GTM_MCS6_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F634Cu)

/** \brief F6350, MCS6 Channel 6 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F6350u)

/** \brief F6354, MCS6 Channel 6 Error Interrupt Enable Register */
#define GTM_MCS6_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F6354u)

/** \brief F6380, MCS6 Channel 7 General Purpose Register 0 */
#define GTM_MCS6_CH7_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6380u)

/** \brief F6384, MCS6 Channel 7 General Purpose Register 1 */
#define GTM_MCS6_CH7_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6384u)

/** \brief F6388, MCS6 Channel 7 General Purpose Register 2 */
#define GTM_MCS6_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6388u)

/** \brief F638C, MCS6 Channel 7 General Purpose Register 3 */
#define GTM_MCS6_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F638Cu)

/** \brief F6390, MCS6 Channel 7 General Purpose Register 4 */
#define GTM_MCS6_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6390u)

/** \brief F6394, MCS6 Channel 7 General Purpose Register 5 */
#define GTM_MCS6_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6394u)

/** \brief F6398, MCS6 Channel 7 General Purpose Register 6 */
#define GTM_MCS6_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F6398u)

/** \brief F639C, MCS6 Channel 7 General Purpose Register 7 */
#define GTM_MCS6_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F639Cu)

/** \brief F63A0, MCS6 Channel 7 Control Register */
#define GTM_MCS6_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F63A0u)

/** \brief F63A4, MCS6 Channel 7 ARU Control Bit Register */
#define GTM_MCS6_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F63A4u)

/** \brief F63BC, MCS6 Channel 7 Memory High Byte Register */
#define GTM_MCS6_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F63BCu)

/** \brief F63C0, MCS6 Channel 7 Program Counter Register */
#define GTM_MCS6_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F63C0u)

/** \brief F63C4, MCS6 Channel 7 Interrupt Notification Register */
#define GTM_MCS6_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F63C4u)

/** \brief F63C8, MCS6 Channel 7 Interrupt Enable Register */
#define GTM_MCS6_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F63C8u)

/** \brief F63CC, MCS6 Channel 7 Force Interrupt Register */
#define GTM_MCS6_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F63CCu)

/** \brief F63D0, MCS6 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS6_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F63D0u)

/** \brief F63D4, MCS6 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS6_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F63D4u)

/** \brief F7000, MCS7 Channel 0 General Purpose Register 0 */
#define GTM_MCS7_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7000u)

/** \brief F7004, MCS7 Channel 0 General Purpose Register 1 */
#define GTM_MCS7_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7004u)

/** \brief F7008, MCS7 Channel 0 General Purpose Register 2 */
#define GTM_MCS7_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7008u)

/** \brief F700C, MCS7 Channel 0 General Purpose Register 3 */
#define GTM_MCS7_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F700Cu)

/** \brief F7010, MCS7 Channel 0 General Purpose Register 4 */
#define GTM_MCS7_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7010u)

/** \brief F7014, MCS7 Channel 0 General Purpose Register 5 */
#define GTM_MCS7_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7014u)

/** \brief F7018, MCS7 Channel 0 General Purpose Register 6 */
#define GTM_MCS7_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7018u)

/** \brief F701C, MCS7 Channel 0 General Purpose Register 7 */
#define GTM_MCS7_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F701Cu)

/** \brief F7020, MCS7 Channel 0 Control Register */
#define GTM_MCS7_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F7020u)

/** \brief F7024, MCS7 Channel 0 ARU Control Bit Register */
#define GTM_MCS7_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F7024u)

/** \brief F7028, MCS7 Clear Trigger Control Register */
#define GTM_MCS7_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F7028u)
/** Alias (User Manual Name) for GTM_MCS7_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS7_CH0_CTRG.
*/
#define GTM_MCS7_CTRG (GTM_MCS7_CH0_CTRG)

/** \brief F702C, MCS7 Set Trigger Control Register */
#define GTM_MCS7_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F702Cu)
/** Alias (User Manual Name) for GTM_MCS7_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS7_CH0_STRG.
*/
#define GTM_MCS7_STRG (GTM_MCS7_CH0_STRG)

/** \brief F703C, MCS7 Channel 0 Memory High Byte Register */
#define GTM_MCS7_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F703Cu)

/** \brief F7040, MCS7 Channel 0 Program Counter Register */
#define GTM_MCS7_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F7040u)

/** \brief F7044, MCS7 Channel 0 Interrupt Notification Register */
#define GTM_MCS7_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F7044u)

