Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F7280, MCS7 Channel 5 General Purpose Register 0 */
#define GTM_MCS7_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7280u)

/** \brief F7284, MCS7 Channel 5 General Purpose Register 1 */
#define GTM_MCS7_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7284u)

/** \brief F7288, MCS7 Channel 5 General Purpose Register 2 */
#define GTM_MCS7_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7288u)

/** \brief F728C, MCS7 Channel 5 General Purpose Register 3 */
#define GTM_MCS7_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F728Cu)

/** \brief F7290, MCS7 Channel 5 General Purpose Register 4 */
#define GTM_MCS7_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7290u)

/** \brief F7294, MCS7 Channel 5 General Purpose Register 5 */
#define GTM_MCS7_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7294u)

/** \brief F7298, MCS7 Channel 5 General Purpose Register 6 */
#define GTM_MCS7_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7298u)

/** \brief F729C, MCS7 Channel 5 General Purpose Register 7 */
#define GTM_MCS7_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F729Cu)

/** \brief F72A0, MCS7 Channel 5 Control Register */
#define GTM_MCS7_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F72A0u)

/** \brief F72A4, MCS7 Channel 5 ARU Control Bit Register */
#define GTM_MCS7_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F72A4u)

/** \brief F72BC, MCS7 Channel 5 Memory High Byte Register */
#define GTM_MCS7_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F72BCu)

/** \brief F72C0, MCS7 Channel 5 Program Counter Register */
#define GTM_MCS7_CH5_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F72C0u)

/** \brief F72C4, MCS7 Channel 5 Interrupt Notification Register */
#define GTM_MCS7_CH5_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F72C4u)

/** \brief F72C8, MCS7 Channel 5 Interrupt Enable Register */
#define GTM_MCS7_CH5_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F72C8u)

/** \brief F72CC, MCS7 Channel 5 Force Interrupt Register */
#define GTM_MCS7_CH5_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F72CCu)

/** \brief F72D0, MCS7 Channel 5 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH5_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F72D0u)

/** \brief F72D4, MCS7 Channel 5 Error Interrupt Enable Register */
#define GTM_MCS7_CH5_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F72D4u)

/** \brief F7300, MCS7 Channel 6 General Purpose Register 0 */
#define GTM_MCS7_CH6_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7300u)

/** \brief F7304, MCS7 Channel 6 General Purpose Register 1 */
#define GTM_MCS7_CH6_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7304u)

/** \brief F7308, MCS7 Channel 6 General Purpose Register 2 */
#define GTM_MCS7_CH6_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7308u)

/** \brief F730C, MCS7 Channel 6 General Purpose Register 3 */
#define GTM_MCS7_CH6_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F730Cu)

/** \brief F7310, MCS7 Channel 6 General Purpose Register 4 */
#define GTM_MCS7_CH6_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7310u)

/** \brief F7314, MCS7 Channel 6 General Purpose Register 5 */
#define GTM_MCS7_CH6_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7314u)

/** \brief F7318, MCS7 Channel 6 General Purpose Register 6 */
#define GTM_MCS7_CH6_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7318u)

/** \brief F731C, MCS7 Channel 6 General Purpose Register 7 */
#define GTM_MCS7_CH6_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F731Cu)

/** \brief F7320, MCS7 Channel 6 Control Register */
#define GTM_MCS7_CH6_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F7320u)

/** \brief F7324, MCS7 Channel 6 ARU Control Bit Register */
#define GTM_MCS7_CH6_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F7324u)

/** \brief F733C, MCS7 Channel 6 Memory High Byte Register */
#define GTM_MCS7_CH6_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F733Cu)

/** \brief F7340, MCS7 Channel 6 Program Counter Register */
#define GTM_MCS7_CH6_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F7340u)

/** \brief F7344, MCS7 Channel 6 Interrupt Notification Register */
#define GTM_MCS7_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F7344u)

/** \brief F7348, MCS7 Channel 6 Interrupt Enable Register */
#define GTM_MCS7_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F7348u)

/** \brief F734C, MCS7 Channel 6 Force Interrupt Register */
#define GTM_MCS7_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F734Cu)

/** \brief F7350, MCS7 Channel 6 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F7350u)

/** \brief F7354, MCS7 Channel 6 Error Interrupt Enable Register */
#define GTM_MCS7_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F7354u)

/** \brief F7380, MCS7 Channel 7 General Purpose Register 0 */
#define GTM_MCS7_CH7_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7380u)

/** \brief F7384, MCS7 Channel 7 General Purpose Register 1 */
#define GTM_MCS7_CH7_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7384u)

/** \brief F7388, MCS7 Channel 7 General Purpose Register 2 */
#define GTM_MCS7_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7388u)

/** \brief F738C, MCS7 Channel 7 General Purpose Register 3 */
#define GTM_MCS7_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F738Cu)

/** \brief F7390, MCS7 Channel 7 General Purpose Register 4 */
#define GTM_MCS7_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7390u)

/** \brief F7394, MCS7 Channel 7 General Purpose Register 5 */
#define GTM_MCS7_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7394u)

/** \brief F7398, MCS7 Channel 7 General Purpose Register 6 */
#define GTM_MCS7_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F7398u)

