Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F739C, MCS7 Channel 7 General Purpose Register 7 */
#define GTM_MCS7_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F739Cu)

/** \brief F73A0, MCS7 Channel 7 Control Register */
#define GTM_MCS7_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F73A0u)

/** \brief F73A4, MCS7 Channel 7 ARU Control Bit Register */
#define GTM_MCS7_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F73A4u)

/** \brief F73BC, MCS7 Channel 7 Memory High Byte Register */
#define GTM_MCS7_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F73BCu)

/** \brief F73C0, MCS7 Channel 7 Program Counter Register */
#define GTM_MCS7_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F73C0u)

/** \brief F73C4, MCS7 Channel 7 Interrupt Notification Register */
#define GTM_MCS7_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F73C4u)

/** \brief F73C8, MCS7 Channel 7 Interrupt Enable Register */
#define GTM_MCS7_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F73C8u)

/** \brief F73CC, MCS7 Channel 7 Force Interrupt Register */
#define GTM_MCS7_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F73CCu)

/** \brief F73D0, MCS7 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS7_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F73D0u)

/** \brief F73D4, MCS7 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS7_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F73D4u)

/** \brief F8000, MCS8 Channel 0 General Purpose Register 0 */
#define GTM_MCS8_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8000u)

/** \brief F8004, MCS8 Channel 0 General Purpose Register 1 */
#define GTM_MCS8_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8004u)

/** \brief F8008, MCS8 Channel 0 General Purpose Register 2 */
#define GTM_MCS8_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8008u)

/** \brief F800C, MCS8 Channel 0 General Purpose Register 3 */
#define GTM_MCS8_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F800Cu)

/** \brief F8010, MCS8 Channel 0 General Purpose Register 4 */
#define GTM_MCS8_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8010u)

/** \brief F8014, MCS8 Channel 0 General Purpose Register 5 */
#define GTM_MCS8_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8014u)

/** \brief F8018, MCS8 Channel 0 General Purpose Register 6 */
#define GTM_MCS8_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8018u)

/** \brief F801C, MCS8 Channel 0 General Purpose Register 7 */
#define GTM_MCS8_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F801Cu)

/** \brief F8020, MCS8 Channel 0 Control Register */
#define GTM_MCS8_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F8020u)

/** \brief F8024, MCS8 Channel 0 ARU Control Bit Register */
#define GTM_MCS8_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F8024u)

/** \brief F8028, MCS8 Clear Trigger Control Register */
#define GTM_MCS8_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F8028u)
/** Alias (User Manual Name) for GTM_MCS8_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS8_CH0_CTRG.
*/
#define GTM_MCS8_CTRG (GTM_MCS8_CH0_CTRG)

/** \brief F802C, MCS8 Set Trigger Control Register */
#define GTM_MCS8_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F802Cu)
/** Alias (User Manual Name) for GTM_MCS8_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS8_CH0_STRG.
*/
#define GTM_MCS8_STRG (GTM_MCS8_CH0_STRG)

/** \brief F803C, MCS8 Channel 0 Memory High Byte Register */
#define GTM_MCS8_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F803Cu)

/** \brief F8040, MCS8 Channel 0 Program Counter Register */
#define GTM_MCS8_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F8040u)

/** \brief F8044, MCS8 Channel 0 Interrupt Notification Register */
#define GTM_MCS8_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F8044u)

/** \brief F8048, MCS8 Channel 0 Interrupt Enable Register */
#define GTM_MCS8_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F8048u)

/** \brief F804C, MCS8 Channel 0 Force Interrupt Register */
#define GTM_MCS8_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F804Cu)

/** \brief F8050, MCS8 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F8050u)

/** \brief F8054, MCS8 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS8_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F8054u)

/** \brief F8060, MCS8 Write Protection Register */
#define GTM_MCS8_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F8060u)

/** \brief F8064, MCS8 Control and Status Register */
#define GTM_MCS8_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F8064u)

/** \brief F8068, MCS8 Reset Register */
#define GTM_MCS8_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F8068u)

/** \brief F806C, MCS8 Cancel ARU Transfer Instruction Register */
#define GTM_MCS8_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F806Cu)

/** \brief F8070, MCS8 Cancel WURM Instruction Register */
#define GTM_MCS8_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F8070u)

/** \brief F807C, MCS8 error register */
#define GTM_MCS8_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F807Cu)

/** \brief F8080, MCS8 Channel 1 General Purpose Register 0 */
#define GTM_MCS8_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8080u)

