Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F8084, MCS8 Channel 1 General Purpose Register 1 */
#define GTM_MCS8_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8084u)

/** \brief F8088, MCS8 Channel 1 General Purpose Register 2 */
#define GTM_MCS8_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8088u)

/** \brief F808C, MCS8 Channel 1 General Purpose Register 3 */
#define GTM_MCS8_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F808Cu)

/** \brief F8090, MCS8 Channel 1 General Purpose Register 4 */
#define GTM_MCS8_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8090u)

/** \brief F8094, MCS8 Channel 1 General Purpose Register 5 */
#define GTM_MCS8_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8094u)

/** \brief F8098, MCS8 Channel 1 General Purpose Register 6 */
#define GTM_MCS8_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8098u)

/** \brief F809C, MCS8 Channel 1 General Purpose Register 7 */
#define GTM_MCS8_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F809Cu)

/** \brief F80A0, MCS8 Channel 1 Control Register */
#define GTM_MCS8_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F80A0u)

/** \brief F80A4, MCS8 Channel 1 ARU Control Bit Register */
#define GTM_MCS8_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F80A4u)

/** \brief F80BC, MCS8 Channel 1 Memory High Byte Register */
#define GTM_MCS8_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F80BCu)

/** \brief F80C0, MCS8 Channel 1 Program Counter Register */
#define GTM_MCS8_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F80C0u)

/** \brief F80C4, MCS8 Channel 1 Interrupt Notification Register */
#define GTM_MCS8_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F80C4u)

/** \brief F80C8, MCS8 Channel 1 Interrupt Enable Register */
#define GTM_MCS8_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F80C8u)

/** \brief F80CC, MCS8 Channel 1 Force Interrupt Register */
#define GTM_MCS8_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F80CCu)

/** \brief F80D0, MCS8 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F80D0u)

/** \brief F80D4, MCS8 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS8_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F80D4u)

/** \brief F8100, MCS8 Channel 2 General Purpose Register 0 */
#define GTM_MCS8_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8100u)

/** \brief F8104, MCS8 Channel 2 General Purpose Register 1 */
#define GTM_MCS8_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8104u)

/** \brief F8108, MCS8 Channel 2 General Purpose Register 2 */
#define GTM_MCS8_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8108u)

/** \brief F810C, MCS8 Channel 2 General Purpose Register 3 */
#define GTM_MCS8_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F810Cu)

/** \brief F8110, MCS8 Channel 2 General Purpose Register 4 */
#define GTM_MCS8_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8110u)

/** \brief F8114, MCS8 Channel 2 General Purpose Register 5 */
#define GTM_MCS8_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8114u)

/** \brief F8118, MCS8 Channel 2 General Purpose Register 6 */
#define GTM_MCS8_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8118u)

/** \brief F811C, MCS8 Channel 2 General Purpose Register 7 */
#define GTM_MCS8_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F811Cu)

/** \brief F8120, MCS8 Channel 2 Control Register */
#define GTM_MCS8_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F8120u)

/** \brief F8124, MCS8 Channel 2 ARU Control Bit Register */
#define GTM_MCS8_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F8124u)

/** \brief F813C, MCS8 Channel 2 Memory High Byte Register */
#define GTM_MCS8_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F813Cu)

/** \brief F8140, MCS8 Channel 2 Program Counter Register */
#define GTM_MCS8_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F8140u)

/** \brief F8144, MCS8 Channel 2 Interrupt Notification Register */
#define GTM_MCS8_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F8144u)

/** \brief F8148, MCS8 Channel 2 Interrupt Enable Register */
#define GTM_MCS8_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F8148u)

/** \brief F814C, MCS8 Channel 2 Force Interrupt Register */
#define GTM_MCS8_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F814Cu)

/** \brief F8150, MCS8 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F8150u)

/** \brief F8154, MCS8 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS8_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F8154u)

/** \brief F8180, MCS8 Channel 3 General Purpose Register 0 */
#define GTM_MCS8_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8180u)

/** \brief F8184, MCS8 Channel 3 General Purpose Register 1 */
#define GTM_MCS8_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8184u)

/** \brief F8188, MCS8 Channel 3 General Purpose Register 2 */
#define GTM_MCS8_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8188u)

/** \brief F818C, MCS8 Channel 3 General Purpose Register 3 */
#define GTM_MCS8_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F818Cu)

/** \brief F8190, MCS8 Channel 3 General Purpose Register 4 */
#define GTM_MCS8_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8190u)

/** \brief F8194, MCS8 Channel 3 General Purpose Register 5 */
#define GTM_MCS8_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8194u)

/** \brief F8198, MCS8 Channel 3 General Purpose Register 6 */
#define GTM_MCS8_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8198u)

