Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F819C, MCS8 Channel 3 General Purpose Register 7 */
#define GTM_MCS8_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F819Cu)

/** \brief F81A0, MCS8 Channel 3 Control Register */
#define GTM_MCS8_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F81A0u)

/** \brief F81A4, MCS8 Channel 3 ARU Control Bit Register */
#define GTM_MCS8_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F81A4u)

/** \brief F81BC, MCS8 Channel 3 Memory High Byte Register */
#define GTM_MCS8_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F81BCu)

/** \brief F81C0, MCS8 Channel 3 Program Counter Register */
#define GTM_MCS8_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F81C0u)

/** \brief F81C4, MCS8 Channel 3 Interrupt Notification Register */
#define GTM_MCS8_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F81C4u)

/** \brief F81C8, MCS8 Channel 3 Interrupt Enable Register */
#define GTM_MCS8_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F81C8u)

/** \brief F81CC, MCS8 Channel 3 Force Interrupt Register */
#define GTM_MCS8_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F81CCu)

/** \brief F81D0, MCS8 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F81D0u)

/** \brief F81D4, MCS8 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS8_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F81D4u)

/** \brief F8200, MCS8 Channel 4 General Purpose Register 0 */
#define GTM_MCS8_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8200u)

/** \brief F8204, MCS8 Channel 4 General Purpose Register 1 */
#define GTM_MCS8_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8204u)

/** \brief F8208, MCS8 Channel 4 General Purpose Register 2 */
#define GTM_MCS8_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8208u)

/** \brief F820C, MCS8 Channel 4 General Purpose Register 3 */
#define GTM_MCS8_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F820Cu)

/** \brief F8210, MCS8 Channel 4 General Purpose Register 4 */
#define GTM_MCS8_CH4_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8210u)

/** \brief F8214, MCS8 Channel 4 General Purpose Register 5 */
#define GTM_MCS8_CH4_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8214u)

/** \brief F8218, MCS8 Channel 4 General Purpose Register 6 */
#define GTM_MCS8_CH4_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8218u)

/** \brief F821C, MCS8 Channel 4 General Purpose Register 7 */
#define GTM_MCS8_CH4_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F821Cu)

/** \brief F8220, MCS8 Channel 4 Control Register */
#define GTM_MCS8_CH4_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F8220u)

/** \brief F8224, MCS8 Channel 4 ARU Control Bit Register */
#define GTM_MCS8_CH4_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F8224u)

/** \brief F823C, MCS8 Channel 4 Memory High Byte Register */
#define GTM_MCS8_CH4_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F823Cu)

/** \brief F8240, MCS8 Channel 4 Program Counter Register */
#define GTM_MCS8_CH4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F8240u)

/** \brief F8244, MCS8 Channel 4 Interrupt Notification Register */
#define GTM_MCS8_CH4_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F8244u)

/** \brief F8248, MCS8 Channel 4 Interrupt Enable Register */
#define GTM_MCS8_CH4_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F8248u)

/** \brief F824C, MCS8 Channel 4 Force Interrupt Register */
#define GTM_MCS8_CH4_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F824Cu)

/** \brief F8250, MCS8 Channel 4 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH4_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F8250u)

/** \brief F8254, MCS8 Channel 4 Error Interrupt Enable Register */
#define GTM_MCS8_CH4_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F8254u)

/** \brief F8280, MCS8 Channel 5 General Purpose Register 0 */
#define GTM_MCS8_CH5_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8280u)

/** \brief F8284, MCS8 Channel 5 General Purpose Register 1 */
#define GTM_MCS8_CH5_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8284u)

/** \brief F8288, MCS8 Channel 5 General Purpose Register 2 */
#define GTM_MCS8_CH5_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8288u)

/** \brief F828C, MCS8 Channel 5 General Purpose Register 3 */
#define GTM_MCS8_CH5_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F828Cu)

/** \brief F8290, MCS8 Channel 5 General Purpose Register 4 */
#define GTM_MCS8_CH5_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8290u)

/** \brief F8294, MCS8 Channel 5 General Purpose Register 5 */
#define GTM_MCS8_CH5_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8294u)

/** \brief F8298, MCS8 Channel 5 General Purpose Register 6 */
#define GTM_MCS8_CH5_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F8298u)

/** \brief F829C, MCS8 Channel 5 General Purpose Register 7 */
#define GTM_MCS8_CH5_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F829Cu)

/** \brief F82A0, MCS8 Channel 5 Control Register */
#define GTM_MCS8_CH5_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F82A0u)

/** \brief F82A4, MCS8 Channel 5 ARU Control Bit Register */
#define GTM_MCS8_CH5_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F82A4u)

/** \brief F82BC, MCS8 Channel 5 Memory High Byte Register */
#define GTM_MCS8_CH5_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F82BCu)

