Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F83D0, MCS8 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS8_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F83D0u)

/** \brief F83D4, MCS8 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS8_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F83D4u)

/** \brief F9000, MCS9 Channel 0 General Purpose Register 0 */
#define GTM_MCS9_CH0_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9000u)

/** \brief F9004, MCS9 Channel 0 General Purpose Register 1 */
#define GTM_MCS9_CH0_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9004u)

/** \brief F9008, MCS9 Channel 0 General Purpose Register 2 */
#define GTM_MCS9_CH0_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9008u)

/** \brief F900C, MCS9 Channel 0 General Purpose Register 3 */
#define GTM_MCS9_CH0_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F900Cu)

/** \brief F9010, MCS9 Channel 0 General Purpose Register 4 */
#define GTM_MCS9_CH0_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9010u)

/** \brief F9014, MCS9 Channel 0 General Purpose Register 5 */
#define GTM_MCS9_CH0_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9014u)

/** \brief F9018, MCS9 Channel 0 General Purpose Register 6 */
#define GTM_MCS9_CH0_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9018u)

/** \brief F901C, MCS9 Channel 0 General Purpose Register 7 */
#define GTM_MCS9_CH0_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F901Cu)

/** \brief F9020, MCS9 Channel 0 Control Register */
#define GTM_MCS9_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F9020u)

/** \brief F9024, MCS9 Channel 0 ARU Control Bit Register */
#define GTM_MCS9_CH0_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F9024u)

/** \brief F9028, MCS9 Clear Trigger Control Register */
#define GTM_MCS9_CH0_CTRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRG*)0xF01F9028u)
/** Alias (User Manual Name) for GTM_MCS9_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS9_CH0_CTRG.
*/
#define GTM_MCS9_CTRG (GTM_MCS9_CH0_CTRG)

/** \brief F902C, MCS9 Set Trigger Control Register */
#define GTM_MCS9_CH0_STRG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_STRG*)0xF01F902Cu)
/** Alias (User Manual Name) for GTM_MCS9_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS9_CH0_STRG.
*/
#define GTM_MCS9_STRG (GTM_MCS9_CH0_STRG)

/** \brief F903C, MCS9 Channel 0 Memory High Byte Register */
#define GTM_MCS9_CH0_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F903Cu)

/** \brief F9040, MCS9 Channel 0 Program Counter Register */
#define GTM_MCS9_CH0_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F9040u)

/** \brief F9044, MCS9 Channel 0 Interrupt Notification Register */
#define GTM_MCS9_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F9044u)

/** \brief F9048, MCS9 Channel 0 Interrupt Enable Register */
#define GTM_MCS9_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F9048u)

/** \brief F904C, MCS9 Channel 0 Force Interrupt Register */
#define GTM_MCS9_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F904Cu)

/** \brief F9050, MCS9 Channel 0 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F9050u)

/** \brief F9054, MCS9 Channel 0 Error Interrupt Enable Register */
#define GTM_MCS9_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F9054u)

/** \brief F9060, MCS9 Write Protection Register */
#define GTM_MCS9_REG_PROT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_REG_PROT*)0xF01F9060u)

/** \brief F9064, MCS9 Control and Status Register */
#define GTM_MCS9_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F9064u)

/** \brief F9068, MCS9 Reset Register */
#define GTM_MCS9_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F9068u)

/** \brief F906C, MCS9 Cancel ARU Transfer Instruction Register */
#define GTM_MCS9_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F906Cu)

/** \brief F9070, MCS9 Cancel WURM Instruction Register */
#define GTM_MCS9_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F9070u)

/** \brief F907C, MCS9 error register */
#define GTM_MCS9_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F907Cu)

/** \brief F9080, MCS9 Channel 1 General Purpose Register 0 */
#define GTM_MCS9_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9080u)

/** \brief F9084, MCS9 Channel 1 General Purpose Register 1 */
#define GTM_MCS9_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9084u)

/** \brief F9088, MCS9 Channel 1 General Purpose Register 2 */
#define GTM_MCS9_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9088u)

/** \brief F908C, MCS9 Channel 1 General Purpose Register 3 */
#define GTM_MCS9_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F908Cu)

/** \brief F9090, MCS9 Channel 1 General Purpose Register 4 */
#define GTM_MCS9_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9090u)

/** \brief F9094, MCS9 Channel 1 General Purpose Register 5 */
#define GTM_MCS9_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9094u)

/** \brief F9098, MCS9 Channel 1 General Purpose Register 6 */
#define GTM_MCS9_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9098u)

/** \brief F909C, MCS9 Channel 1 General Purpose Register 7 */
#define GTM_MCS9_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F909Cu)

/** \brief F90A0, MCS9 Channel 1 Control Register */
#define GTM_MCS9_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F90A0u)

/** \brief F90A4, MCS9 Channel 1 ARU Control Bit Register */
#define GTM_MCS9_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F90A4u)

/** \brief F90BC, MCS9 Channel 1 Memory High Byte Register */
#define GTM_MCS9_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F90BCu)

/** \brief F90C0, MCS9 Channel 1 Program Counter Register */
#define GTM_MCS9_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F90C0u)

