Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F90C4, MCS9 Channel 1 Interrupt Notification Register */
#define GTM_MCS9_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F90C4u)

/** \brief F90C8, MCS9 Channel 1 Interrupt Enable Register */
#define GTM_MCS9_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F90C8u)

/** \brief F90CC, MCS9 Channel 1 Force Interrupt Register */
#define GTM_MCS9_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F90CCu)

/** \brief F90D0, MCS9 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F90D0u)

/** \brief F90D4, MCS9 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS9_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F90D4u)

/** \brief F9100, MCS9 Channel 2 General Purpose Register 0 */
#define GTM_MCS9_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9100u)

/** \brief F9104, MCS9 Channel 2 General Purpose Register 1 */
#define GTM_MCS9_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9104u)

/** \brief F9108, MCS9 Channel 2 General Purpose Register 2 */
#define GTM_MCS9_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9108u)

/** \brief F910C, MCS9 Channel 2 General Purpose Register 3 */
#define GTM_MCS9_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F910Cu)

/** \brief F9110, MCS9 Channel 2 General Purpose Register 4 */
#define GTM_MCS9_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9110u)

/** \brief F9114, MCS9 Channel 2 General Purpose Register 5 */
#define GTM_MCS9_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9114u)

/** \brief F9118, MCS9 Channel 2 General Purpose Register 6 */
#define GTM_MCS9_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9118u)

/** \brief F911C, MCS9 Channel 2 General Purpose Register 7 */
#define GTM_MCS9_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F911Cu)

/** \brief F9120, MCS9 Channel 2 Control Register */
#define GTM_MCS9_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F9120u)

/** \brief F9124, MCS9 Channel 2 ARU Control Bit Register */
#define GTM_MCS9_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F9124u)

/** \brief F913C, MCS9 Channel 2 Memory High Byte Register */
#define GTM_MCS9_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F913Cu)

/** \brief F9140, MCS9 Channel 2 Program Counter Register */
#define GTM_MCS9_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F9140u)

/** \brief F9144, MCS9 Channel 2 Interrupt Notification Register */
#define GTM_MCS9_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F9144u)

/** \brief F9148, MCS9 Channel 2 Interrupt Enable Register */
#define GTM_MCS9_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F9148u)

/** \brief F914C, MCS9 Channel 2 Force Interrupt Register */
#define GTM_MCS9_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F914Cu)

/** \brief F9150, MCS9 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F9150u)

/** \brief F9154, MCS9 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS9_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F9154u)

/** \brief F9180, MCS9 Channel 3 General Purpose Register 0 */
#define GTM_MCS9_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9180u)

/** \brief F9184, MCS9 Channel 3 General Purpose Register 1 */
#define GTM_MCS9_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9184u)

/** \brief F9188, MCS9 Channel 3 General Purpose Register 2 */
#define GTM_MCS9_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9188u)

/** \brief F918C, MCS9 Channel 3 General Purpose Register 3 */
#define GTM_MCS9_CH3_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F918Cu)

/** \brief F9190, MCS9 Channel 3 General Purpose Register 4 */
#define GTM_MCS9_CH3_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9190u)

/** \brief F9194, MCS9 Channel 3 General Purpose Register 5 */
#define GTM_MCS9_CH3_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9194u)

/** \brief F9198, MCS9 Channel 3 General Purpose Register 6 */
#define GTM_MCS9_CH3_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9198u)

/** \brief F919C, MCS9 Channel 3 General Purpose Register 7 */
#define GTM_MCS9_CH3_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F919Cu)

/** \brief F91A0, MCS9 Channel 3 Control Register */
#define GTM_MCS9_CH3_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F91A0u)

/** \brief F91A4, MCS9 Channel 3 ARU Control Bit Register */
#define GTM_MCS9_CH3_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F91A4u)

/** \brief F91BC, MCS9 Channel 3 Memory High Byte Register */
#define GTM_MCS9_CH3_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F91BCu)

/** \brief F91C0, MCS9 Channel 3 Program Counter Register */
#define GTM_MCS9_CH3_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F91C0u)

/** \brief F91C4, MCS9 Channel 3 Interrupt Notification Register */
#define GTM_MCS9_CH3_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F91C4u)

/** \brief F91C8, MCS9 Channel 3 Interrupt Enable Register */
#define GTM_MCS9_CH3_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F91C8u)

/** \brief F91CC, MCS9 Channel 3 Force Interrupt Register */
#define GTM_MCS9_CH3_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F91CCu)

/** \brief F91D0, MCS9 Channel 3 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH3_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F91D0u)

/** \brief F91D4, MCS9 Channel 3 Error Interrupt Enable Register */
#define GTM_MCS9_CH3_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F91D4u)

/** \brief F9200, MCS9 Channel 4 General Purpose Register 0 */
#define GTM_MCS9_CH4_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9200u)

/** \brief F9204, MCS9 Channel 4 General Purpose Register 1 */
#define GTM_MCS9_CH4_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9204u)

/** \brief F9208, MCS9 Channel 4 General Purpose Register 2 */
#define GTM_MCS9_CH4_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9208u)

/** \brief F920C, MCS9 Channel 4 General Purpose Register 3 */
#define GTM_MCS9_CH4_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F920Cu)

