Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_reg.h
/** \brief F9324, MCS9 Channel 6 ARU Control Bit Register */
#define GTM_MCS9_CH6_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F9324u)

/** \brief F933C, MCS9 Channel 6 Memory High Byte Register */
#define GTM_MCS9_CH6_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F933Cu)

/** \brief F9340, MCS9 Channel 6 Program Counter Register */
#define GTM_MCS9_CH6_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F9340u)

/** \brief F9344, MCS9 Channel 6 Interrupt Notification Register */
#define GTM_MCS9_CH6_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F9344u)

/** \brief F9348, MCS9 Channel 6 Interrupt Enable Register */
#define GTM_MCS9_CH6_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F9348u)

/** \brief F934C, MCS9 Channel 6 Force Interrupt Register */
#define GTM_MCS9_CH6_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F934Cu)

/** \brief F9350, MCS9 Channel 6 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH6_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F9350u)

/** \brief F9354, MCS9 Channel 6 Error Interrupt Enable Register */
#define GTM_MCS9_CH6_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F9354u)

/** \brief F9380, MCS9 Channel 7 General Purpose Register 0 */
#define GTM_MCS9_CH7_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9380u)

/** \brief F9384, MCS9 Channel 7 General Purpose Register 1 */
#define GTM_MCS9_CH7_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9384u)

/** \brief F9388, MCS9 Channel 7 General Purpose Register 2 */
#define GTM_MCS9_CH7_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9388u)

/** \brief F938C, MCS9 Channel 7 General Purpose Register 3 */
#define GTM_MCS9_CH7_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F938Cu)

/** \brief F9390, MCS9 Channel 7 General Purpose Register 4 */
#define GTM_MCS9_CH7_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9390u)

/** \brief F9394, MCS9 Channel 7 General Purpose Register 5 */
#define GTM_MCS9_CH7_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9394u)

/** \brief F9398, MCS9 Channel 7 General Purpose Register 6 */
#define GTM_MCS9_CH7_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F9398u)

/** \brief F939C, MCS9 Channel 7 General Purpose Register 7 */
#define GTM_MCS9_CH7_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F939Cu)

/** \brief F93A0, MCS9 Channel 7 Control Register */
#define GTM_MCS9_CH7_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F93A0u)

/** \brief F93A4, MCS9 Channel 7 ARU Control Bit Register */
#define GTM_MCS9_CH7_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F93A4u)

/** \brief F93BC, MCS9 Channel 7 Memory High Byte Register */
#define GTM_MCS9_CH7_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F93BCu)

/** \brief F93C0, MCS9 Channel 7 Program Counter Register */
#define GTM_MCS9_CH7_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F93C0u)

/** \brief F93C4, MCS9 Channel 7 Interrupt Notification Register */
#define GTM_MCS9_CH7_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F93C4u)

/** \brief F93C8, MCS9 Channel 7 Interrupt Enable Register */
#define GTM_MCS9_CH7_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F93C8u)

/** \brief F93CC, MCS9 Channel 7 Force Interrupt Register */
#define GTM_MCS9_CH7_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F93CCu)

/** \brief F93D0, MCS9 Channel 7 Interrupt Mode Configuration Register */
#define GTM_MCS9_CH7_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F93D0u)

/** \brief F93D4, MCS9 Channel 7 Error Interrupt Enable Register */
#define GTM_MCS9_CH7_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F93D4u)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXGTM_REG_H */
